{
  "electrolyte": {
    "[B-](F)(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 1,
    "[F-][B+3]([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 2,
    "[Li+].[O-]Cl(=O)(=O)=O": 3,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 4,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]Cl(=O)(=O)=O": 5,
    "CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 6,
    "[F-][P+5]([F-])([F-])([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 7,
    "[Li].O=Cl(=O)(=O)O": 8,
    "[B-](F)(F)(F)F.CC[N+](CC)(CC)CC": 9,
    "[Li+].[O-][Cl](=O)(=O)=O": 10,
    "CCCC[N+](CCCC)(CCCC)CCCC.[Br-]": 11,
    "CC[N+](CC)(CC)CC.F[P-](F)(F)(F)(F)F": 12,
    "CCCC[N+](CCCC)(CCCC)CCCC.[B-](F)(F)(F)F": 13,
    "CCCC[N+](CCCC)(CCCC)CCCC.CC([O-])=O": 14,
    "[F-][B+3]([F-])([F-])[F-].CC[N+](CC)(CC)CC": 15,
    "[K+].[Br-]": 16,
    "CC[N+](CC)(CC)CC.[Cl-]": 17,
    "O=Cl(=O)(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 18,
    "[Na+].[I-]": 19,
    "[Li+].O.O.O.[O-][Cl](=O)(=O)=O": 20,
    "[I-].CCCC[N+](CCCC)(CCCC)CCCC": 21,
    "[I-].CC[N+](CC)(CC)CC": 22,
    "F[P-](F)(F)(F)(F)F.[K+]": 23,
    "[Li+].[Cl-]": 24,
    "[Li+].C(F)(F)(F)S(=O)(=O)[O-]": 25,
    "[K+].[I-]": 26,
    "CC[N+](CC)(CC)CC.[O-]Cl(=O)(=O)=O": 27,
    "O=C([O-])C.CCCC[N+](CCCC)(CCCC)CCCC": 28,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 29,
    "[Br-].CCCC[N+](CCCC)(CCCC)CCCC": 30,
    "[Li+].[Br-]": 31,
    "F[B-](F)(F)F.C(CCC)[N+](CCCC)(CCCC)CCCC": 32,
    "[F-][P+5]([F-])([F-])([F-])([F-])[F-].CC[N+](CC)(CC)CC": 33,
    "[Cl-].CC[N+](CC)(CC)CC": 34,
    "[Na+].[Br-]": 35,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[B-](F)(F)(F)F": 36,
    "[Li+].[B-](F)(F)(F)F": 37,
    "C[N+](C)(C)CC1=CC=CC=C1.[Cl-]": 38,
    "CCCC[N+](CCCC)(CCCC)CCCC.[F-]": 39,
    "[Cl-].CCCC[N+](CCCC)(CCCC)CCCC": 40,
    "[Na+].CC(C)(C)C([O-])=O": 41,
    "C(=O)(O)[O-].[K+]": 42,
    "CC[N+](CC)(CC)CC.[Br-]": 43,
    "CC[N+](CC)(CC)CC.[B-](F)(F)(F)F": 44,
    "O=Cl(=O)(=O)[O-].CC[N+](CC)(CC)CC": 45,
    "[Li]Cl": 46,
    "Cl(=O)(=O)(=O)[O-].[Li+]": 47,
    "[B-](F)(F)(F)F.C[N+](C)(C)C": 48,
    "F.N(CC)(CC)CC": 49,
    "[NH4+].[I-]": 50,
    "[Li+].[I-]": 51,
    "F[P-](F)(F)(F)(F)F.C(CCC)[N+](CCCC)(CCCC)CCCC": 52,
    "CCCC[N+](CCCC)(CCCC)CCCC.CC(=O)[O-]": 53,
    "[F-].CCCC[N+](CCCC)(CCCC)CCCC": 54,
    "CCN(CC)CC.F.F.F": 55,
    "CC[N+](CC)(CC)CC.[I-]": 56,
    "[Li].O=S(=O)(O)C(F)(F)F": 57,
    "[O-]S(=O)S(=O)(=O)[O-].[Na+].[Na+]": 58,
    "CC[N+](CC)(CC)CC.CC1=CC=C(C=C1)S(=O)(=O)[O-]": 59,
    "[Na+].[Cl-]": 60,
    "O=S(O)C(F)(F)F.[Na]": 61,
    "CCCC[N+]1=CN(C=C1)C=C.[Br-]": 62,
    "[Cl-].C=1C=CC(=CC1)C[N+](C)(C)C": 63,
    "CCCC[N+](CCCC)(CCCC)CCCC.OS(=O)(=O)[O-]": 64,
    "[K+].[F-][P+5]([F-])([F-])([F-])([F-])[F-]": 65,
    "[H+].[Br-]": 66,
    "CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 67,
    "[Na]I": 68,
    "N.N#CS": 69,
    "[N-]=[N+]=[N-].[Na+]": 70,
    "[Br-].CC[N+](CC)(CC)CC": 71,
    "C(=O)(C(F)(F)F)O": 72,
    "CCCC[N+](CCCC)(CCCC)CCCC.[OH-]": 73,
    "[Li+].O=Cl(=O)(=O)[O-]": 74,
    "[Li+].[F-][B+3]([F-])([F-])[F-]": 75,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[O-]Cl(=O)(=O)=O": 76,
    "C(=O)([O-])[O-].[Na+].[Na+]": 77,
    "O=C([O-])C.O=C(O)C.CCCC[N+](CCCC)(CCCC)CCCC": 78,
    "Cl(=O)(=O)(=O)[O-].C(CCC)[N+](CCCC)(CCCC)CCCC": 79,
    "[B-](F)(F)(F)F.[N+](CCCC)(CCCC)(CCCC)CCCC": 80,
    "C[O-].[Na+]": 81,
    "[NH4+].[S-]C#N": 82,
    "CC(C)(C)C(=O)[O-].[Na+]": 83,
    "CC[N+](CC)(CC)CC.F[B-](F)(F)F": 84,
    "O=S(=O)([O-])[O-].CCCC[N+](CCCC)(CCCC)CCCC": 85,
    "C(=O)(O)[O-].[Na+]": 86,
    "[NH4+].F[P-](F)(F)(F)(F)F": 87,
    "[K]Br": 88,
    "[Li]Br": 89,
    "[K].O=C(O)O": 90,
    "[Na].O=C(O)C(C)(C)C": 91,
    "CCCCN1C=C[N+](=C1)C.F[P-](F)(F)(F)(F)F": 92,
    "[I-].C[N+](C)(C)C": 93,
    "F.F.F.C(C)N(CC)CC": 94,
    "CCCC[N+](CCCC)(CCCC)CCCC.FB(F)(F)[F-]": 95,
    "[NH4+].[NH4+].OP(=O)([O-])[O-]": 96,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[I-]": 97,
    "[OH-].[K+]": 98,
    "CCCC[N+](CCCC)(CCCC)CCCC.[P-](F)(F)(F)(F)(F)F": 99,
    "[K]I": 100,
    "[I-].C(CCC)[N+](CCCC)(CCCC)CCCC": 101,
    "C1=CC=NC=C1.F": 102,
    "[Mg+2].[Br-].[Br-]": 103,
    "C[N+](C)(C)C.[I-]": 104,
    "[B-](C1=C(C(=C(C(=C1F)F)F)F)F)(C2=C(C(=C(C(=C2F)F)F)F)F)(C3=C(C(=C(C(=C3F)F)F)F)F)C4=C(C(=C(C(=C4F)F)F)F)F.CCCC[N+](CCCC)(CCCC)CCCC": 105,
    "CCN(CC)CC.F.F.F.F.F": 106,
    "[O-]S(=O)(=S)[O-].[Na+].[Na+]": 107,
    "O=S(=O)([O-])C1=CC=C(C=C1)C.CC[N+](CC)(CC)CC": 108,
    "[F-].F.CC[N+](CC)(CC)CC": 109,
    "FC=1C(F)=C(F)[C-](=C(F)C1F)[B+3]([C-]=2C(F)=C(F)C(F)=C(F)C2F)([C-]=3C(F)=C(F)C(F)=C(F)C3F)[C-]=4C(F)=C(F)C(F)=C(F)C4F.CCCC[N+](CCCC)(CCCC)CCCC": 110,
    "[K+].[OH-]": 111,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[P-](F)(F)(F)(F)(F)F": 112,
    "I[NH4]": 113,
    "[NH4+].[NH4+].O[P]([O-])([O-])=O": 114,
    "[Mg+2].[Cl-].[Cl-]": 115,
    "Cc1ccc(S(=O)(=O)O)cc1": 116,
    "F.N=1C=CC=CC1": 117,
    "CS(=O)(=O)O": 118,
    "N#CS.N": 119,
    "Li+.[Cl-]": 120,
    "CCCC[N+](CCCC)(CCCC)CCCC.[Cl-]": 121,
    "[Li+].C(=O)[O-]": 122,
    "[OH-].C[N+](C)(C)Cc1ccccc1": 123,
    "[OH-].C=1C=CC(=CC1)C[N+](C)(C)C": 124,
    "[OH-].CCCC[N+](CCCC)(CCCC)CCCC": 125,
    "F[B-](F)(F)F.C(C)[N+](CC)(CC)CC": 126,
    "CC(=O)O": 127,
    "C(F)(F)(F)S(=O)(=O)O": 128,
    "[S-]C#N.[NH4+]": 129,
    "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O-]S(=O)(=O)[O-]": 130,
    "[K]O": 131,
    "O=S(=O)(O)C1=CC=C(C=C1)C": 132,
    "[Li+].[O-]S(=O)(=O)C(F)(F)F": 133,
    "[I-].C(C)[N+](CC)(CC)CC": 134,
    "CCCC[N+](CCCC)(CCCC)CCCC.[B-](C1=C(C(=C(C(=C1F)F)F)F)F)(C2=C(C(=C(C(=C2F)F)F)F)F)(C3=C(C(=C(C(=C3F)F)F)F)F)C4=C(C(=C(C(=C4F)F)F)F)F": 135,
    "F[P-](F)(F)(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 136,
    "N#CS.[K]": 137,
    "[Li]I": 138,
    "O=S(O)C(F)F.[Na]": 139,
    "CC[N+](CC)(CC)CC.F.F.F.[F-]": 140,
    "[N-]=[N+]=N[Na]": 141,
    "CCCC[N+](CCCC)(CCCC)CCCC.[F-]P(F)(F)(F)(F)F": 142,
    "[B-](F)(F)(F)F.[N+](CC)(CC)(CC)CC": 143,
    "[Br-].C(CCC)[N+](CCCC)(CCCC)CCCC": 144,
    "O=C(O)C(F)(F)F": 145,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F\u3001CC(=O)[O-].[Na+]": 146,
    "CC(C)(C)C(=O)[O-].[K+]": 147,
    "F": 148,
    "C(=O)([O-])[O-].[Ca+2]": 149,
    "[Cs+].[F-]": 150,
    "[K].N#CS": 151,
    "[K+].F[P-](F)(F)(F)(F)F": 152,
    "Cc1ccc(cc1)[S](O)(=O)=O": 153,
    "[Li].C(F)(F)(F)S(=O)(=O)NS(=O)(=O)C(F)(F)F": 154,
    "[Na].O=S(=O)(O)S": 155,
    "[Na]Br": 156,
    "[Fe].O=N(=O)O": 157,
    "O=P(O)(O)O.N": 158,
    "Br.N=1C=CC=CC1": 159,
    "O=S(=O)([O-])O.CCCC[N+](CCCC)(CCCC)CCCC": 160,
    " [F-][B+3]([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 161,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]S(=O)(=O)[O-]": 162,
    "[F-][P+5]([F-])([F-])([F-])([F-])[F-].C1=C[N+](=CN1C)CCCC": 163,
    "C(=O)([O-])[O-].[K+].[K+]": 164,
    "CCCCN+(CCCC)CCCC.[BF4-]": 165,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[O-]S(=O)(=O)[O-]": 166,
    "Bu4NBF4": 167,
    " [B-](F)(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 168,
    "F[P-](F)(F)(F)(F)F.C(C)[N+](CC)(CC)CC": 169,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[Cl-]": 170,
    "CC#N": 171,
    "[K+].[S-]C#N": 172,
    "[Na].O=S(O)S(=O)(=O)O": 173,
    "[F-][B+3]([F-])([F-])[F-].C[N+](C)(C)C": 174,
    "[K+].[K+].[O-]C([O-])=O": 175,
    "[N+](=O)([O-])[O-].[Ag+]": 176,
    "CCCC[N+](CCCC)(CCCC)CCCC.CC([O-])=O\u3001[O-]S(=O)(=S)[O-].[Na+].[Na+]": 177,
    "C1=CC=NC=C1.Br": 178,
    "CC[N+](CC)(CC)CC.[F-]": 179,
    "CCCC[N+](C)(CCCC)CCCC.COS(=O)(=O)[O-]": 180,
    "[NH4+].[Cl-]": 181,
    " [F-][P+5]([F-])([F-])([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 182,
    "[Na].O=S(O)C(F)(F)F": 183,
    "[F-][H+][F-][H+][F-].CC[N+](CC)(CC)CC": 184,
    "[Na+].[O-]S(=O)(=O)C(F)(F)F": 185,
    "Br": 186,
    "CC(=O)[O-].[K+]": 187,
    "C(C)(=O)[O-].C(CCC)[N+](CCCC)(CCCC)CCCC": 188,
    "Cl(=O)(=O)(=O)[O-].C(C)[N+](CC)(CC)CC": 189,
    "Cc1ccc(S(=O)(=O)O)cc1.[Na]": 190,
    "[K+].O=C([O-])O": 191,
    "[Li+].[O-]Cl(=O)(=O)=O\u3001[NH4+].[I-]": 192,
    "[Cl-].C(C1=CC=CC=C1)[N+](C)(C)C": 193,
    "[N+](CC)(CC)(CC)CC.[I-]": 194,
    "O=S(=O)(O)C(F)(F)F": 195,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]C(=O)C": 196,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.CC(=O)[O-]": 197,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[N+](CCCC)(CCCC)(CCCC)CCCC.[O-]S(=O)(=O)[O-]": 198,
    "CC[N+](CC)(CC)CC.FB(F)(F)[F-]": 199,
    "[N+](C)(C)(C)C[B-](F)(F)(F)(F)F": 200,
    "[I-].[N+](CC)(CC)(CC)CC": 201,
    "[K].O=C(O)C(C)(C)C": 202,
    "[K+].C(=O)(O)[O-]": 203,
    "[F-][P+5]([F-])([F-])([F-])([F-])[F-].[NH4+]": 204,
    "O=S(=O)(F)Cl": 205,
    "[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[Fe+3]": 206,
    "[N+](CC)(CC)(CC)CC.[B-](F)(F)(F)F": 207,
    "[Na]Cl": 208,
    "[Na+].[O-]C(=O)C(C)(C)C": 209,
    "F[B-](F)(F)F.[Li+]": 210,
    "F[B-](F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 211,
    "CCCC[N+](CCCC)(CCCC)CCCC.[F-][B+3]([F-])([F-])[F-]": 212,
    "C[N+](C)(C)C.[B-](F)(F)(F)F": 213,
    "[F-].[K+]": 214,
    "[Mn].O=S(=O)(O)C(F)(F)F": 215,
    "[Cl-].[Li+]": 216,
    "FC(C(=O)O)(F)F": 217,
    "5.6 HF stock solution": 218,
    "[F-].[Cs+]": 219,
    "[Na+].[Na+].O=S(=O)([O-])OS(=O)[O-]": 220,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-][Cl+3]([O-])([O-])[O-]": 221,
    "[OH-].C(C1=CC=CC=C1)[N+](C)(C)C": 222,
    "CCCCN+(CCCC)CCCC.[Br-]": 223,
    "[I-].[N+](CCCC)(CCCC)(CCCC)CCCC": 224,
    "CCCCN+(CCCC)CCCC.[Br]-": 225,
    "Cc1ccc(I)cc1": 226,
    "O=C(O)[O-].[K+]": 227,
    "C([O-])(O)=O.[K+]": 228,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[P-](F)(F)(F)(F)F": 229,
    "[Cl-].C(C)[N+](CC)(CC)CC": 230,
    "C(C(C)(C)C)N+([B](F)(F)F)F": 231,
    "C(C(C)(C)C)N+([I-])": 232,
    " F[P-](F)(F)(F)(F)F.[K+]": 233,
    " CCCC[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 234,
    "[Na].O=C(O)O": 235,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F\u3001C(=O)([O-])[O-].[K+].[K+]": 236,
    "CC[N+](CC)(CC)CC.F.F.F.[F-]\u3001C(=O)(O)[O-].[Na+]": 237,
    "[I-].[Na+]": 238,
    "[Li+].[Cl-](=O)(=O)(=O)=O": 239,
    "C[N+](C)(C)Cc1ccccc1.[Cl-]": 240,
    "CCCCN+(CCCC)CCCC.[ClO4-]": 241,
    "\tCCCCN+(CCCC)CCCC.[O-]C(=O)C": 242,
    "Li+.[O-]Cl(=O)(=O)=O": 243,
    "[N+](CC)(CC)(CC)CC.[Br-]": 244,
    "NH4+.[I-]": 245,
    "[Li+].O=S(=O)([O-])C(F)(F)F": 246,
    "[S-]C#N.[K+]": 247,
    "[Li+].[ClO4-]": 248,
    "CCCC[N+](CCCC)(CCCC)CCCC.[Br]-": 249,
    "[N+](CC)(CC)(CC)CC.[P-](F)(F)(F)(F)F": 250,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[Br-]": 251,
    "C(CCCC)[N+](CCCC)(CCCC)CCCC.[I-]": 252,
    "O=S(=O)([O-])C(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 253,
    "O=C([O-])[O-].[K+].[K+]": 254,
    "[H+].[Cl-]": 255,
    "CC(=O)O.N": 256,
    "C(C(F)(F)F)O": 257,
    "[O-]P(=O)([O-])[O-].[K+].[K+].[K+]": 258,
    "[Na].O=S(O)C1=CC=C(C=C1)C": 259,
    "[Li+].[O-][Cl+3](=O)(=O)[O-]": 260,
    "Br[Mg]Br": 261,
    "[Li+][O-][Cl](=O)(=O)=O": 262,
    "\tNa+.[Br-]": 263,
    "CCCN+(CC)CC.[Cl-]": 264,
    "OCCN(CCO)CCO": 265,
    "[Li+].[Cl-]\u3001[N+](=O)([O-])[O-].[Ag+]": 266,
    "CN(C=O)C": 267,
    "CCCC[N+](CCCC)(CCCC)CCCC.CC(=O)[O-].CC(=O)[O-]": 268,
    "C1COCCO1": 269,
    "tetrabutylammonium bromide ": 270,
    "[B-](F)(F)(F)F.CC[N+](CC)(CC)CC\u3001[Li+].[Br-]": 271,
    "CN(C)C=O": 272,
    "[Na].O=P(O)(O)O": 273,
    "[Zn].O=S(=O)(O)C(F)(F)F": 274,
    "CC(C)(C)C(=O)[O-].[K+] ": 275,
    "[Br-].CCCC[P+](CCCC)(CCCC)CCCC": 276,
    "[Li+].F[P-](F)(F)(F)(F)F": 277,
    "[Fe].O=S(=O)(O)C(F)(F)F": 278,
    "[Na+].[O-]S(=O)OS(=O)(=O)[O-]": 279,
    "CCCC[N+](CCCC)(CCCC)CCCC.[Br-], CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 280,
    "CCCC[N+](CCCC)(CCCC)CCCC.FB(F)(F)F": 281,
    "[N+](CC)(CC)(CC)CC.[F-]": 282,
    "[F-][B+3]([F-])([F-])[C-]#CC1=CC=CC=C1.[K+]": 283,
    "C[N+](C)(C)C.F[B-](F)(F)F": 284,
    "[Li+].[B-](C1=CC=CC=C1)(C2=CC=CC=C2)(C3=CC=CC=C3)C4=CC=CC=C4": 285,
    "FC(S(=O)[O-])F.[Na+]": 286,
    "O=S(=O)(O)c1ccc(-c2ccccc2)cc1.[Na]": 287,
    "F.F.F.[F-].C(C)[N+](CC)(CC)CC": 288,
    "[[F-][B+3]([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 289,
    "[H+]N(CC)(CC)CC.[F-]": 290,
    "O=S(=O)(NNC)c1ccc(C)cc1": 291,
    "CCN(CC)CC.F": 292,
    " [N-]=[N+]=N[Na]": 293,
    "O=S([O-])C(F)(F)F.[Na+]": 294,
    "[F-][B+3]([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCC": 295,
    "[Li+].[Br-]     and     [Fe+3].[O-][N+](=O)[O-]": 296,
    "OP(=O)(O)O": 297,
    "CC[N+](CC)(CC)CC.[B-](F)(F)(F)F.[Na+].[Br-]": 298,
    "FC(S(=O)[O-])(F)F": 299,
    "CC1=CC=C(C=C1)S(=O)(=O)O.C1CCOC1.C(Cl)Cl.O": 300,
    "N(=[N+]=[N-])[Si](C)(C)C": 301,
    "[NH4+].[O-][N+]([O-])=O": 302,
    "[F-].CC[N+](CC)(CC)CC": 303,
    "KI": 304,
    "[K+].[B-](C)(F)(F)F\uff09": 305,
    "O=S([O-])C(F)F.[Na+]": 306,
    "[K+].[B-](CCCCCC)(F)(F)F": 307,
    "  F[B-](F)(F)F.C(CCC)[N+](CCCC)(CCCC)CCCC": 308,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]S(=O)(=O)O": 309,
    "[H+].[Cl-].CCN(CC)CC": 310,
    "C(C)(=O)[O-].[NH4+]": 311,
    "[NH4+].[O-]C(=O)C": 312,
    "[Li+].[O-]Cl(=O)(=O)O": 313,
    "F.[F-].C(C)[N+](CC)(CC)CC": 314,
    "[Li+].Cl(=O)([O-])(=O)=O": 315,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)\u3001C(=O)([O-])[O-].[K+].[K+]": 316,
    "[OH-].CC[N+](CC)(CC)CC": 317,
    "C[N+](C)(C)Cc1ccccc1.[OH-]": 318,
    "C(=O)(O)C(F)(F)F": 319,
    "CC[N+](CC)(CC)CC.[I-].[NH4+].[I-]": 320,
    "[Li+].[O-][Cl](=O)(=O)=O.[Li+].[I-]": 321,
    "[B-](F)(F)(F)F.[Na+]": 322,
    "CC[N+]1(CCCC1)C.[Br-]": 323,
    "O=S(=O)([O-])C(F)(F)F.[Na+]": 324,
    "[Cl-].[N+](CC)(CC)(CC)CC": 325,
    "[Na+].[I-]\u3001[K+].[I-]": 326,
    "[P-](F)(F)(F)(F)(F)F.[N+](CCCC)(CCCC)(CCCC)CCCC": 327,
    "CC[N+](CC)(CC)CC.[Cl-](=O)(=O)(=O)O": 328,
    "C(C(C(C(C)C)C)C)N+.[BF4-]": 329,
    "[N+](CCCC)(CCCC)(CCCC)(CCCC).[O-]Cl(=O)(=O)=O": 330,
    "[Li+].[ClO4]-": 331,
    "CCCC[N+](CCCC)(CCCC)CCCC.[BF4]-": 332,
    "\tNa+.[Br]-": 333,
    "O=S(O)C(F)(F)F.[K]": 334,
    "H+.[Cl-]": 335,
    "O=S(=O)(O)c1cccc(Br)c1.[Na]": 336,
    "[K+].[K+].O=S(=O)(OS(=O)=O)[O-]": 337,
    "C[N+](CC)(CC)CC.[B-](F)(F)(F)F": 338,
    "[K].O=C(O)C": 339,
    "CC(=O)[O-].[Cs+]": 340,
    "F.F.F.F.F.C(C)N(CC)CC": 341,
    "[Na].O=S(=O)(O)O": 342,
    "Na+.[I-]": 343,
    "[Br-].[Na+]": 344,
    "[K+].Brl-]": 345,
    "CC[N+](CC)(CC)CC.[F-]P(F)(F)(F)(F)F": 346,
    "FC(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)Br": 347,
    "[OH-].C(C)[N+](CC)(CC)CC": 348,
    "[Mg++].[Cl-].[Cl-]": 349,
    "ClC(Cl)C": 350,
    "C(C(C)(C)C)N+([Cl-])": 351,
    "CCCCN+CCCC.[Br-]": 352,
    "[O-]Cl(=O)(=O)=O.CCCC[N+](CCCC)(CCCC)CCCC": 353,
    "CC[N+](CC)(CC)CC.[B-](F)(F)(F)F\u3002": 354,
    " CCCC[N+](CCCC)(CCCC)CCCC.[Cl-]": 355,
    "CCCC[N+](CCCC)(CCCC)CCCC.[F-][B-](F)(F)F": 356,
    "[Li+].[Cl+3]([O-])([O-])([O-])[O-]": 357,
    "[Li+].[O-]=Cl(=O)(=O)=O": 358,
    " [Li+].[O-][Cl](=O)(=O)=O": 359,
    "[F][B-]([F])([F])[F].CC[N+](CC)(CC)CC": 360,
    "Clc1ccc(Br)cc1": 361,
    "O=S(=O)(F)Cl ": 362,
    "CCCC[N+](CCCC)(CCCC)C.COS(=O)(=O)[O-]": 363,
    "CCCC[N+](CCCC)(CCCC)CCCC.[BF4-]": 364,
    "[O-]Cl(=O)(=O)=O.[Li+]": 365,
    " CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 366,
    "[Li+].F[B-](F)(F)F": 367,
    "CCCC[N+](CCCC)(CCCC)CCCC.O=Cl(=O)([O-])[O-]": 368,
    "[N+](=O)([O-])[O-].[Ag+] (AgNO3 \u7684 SMILES)": 369,
    "CCCC[N+](CCCC)(CCCC)CCCC.[I-]\u3001C(=O)([O-])[O-].[K+].[K+]": 370,
    "CCCC[N+](CCCC)(CCCC)CCCC.[B-]": 371,
    "[B-](F)(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC\u3001[O-]S(=O)S(=O)(=O)[O-].[K+].[K+]": 372,
    "CCCC[N+](CCCC)(CCCC)CCCC.[I-]\u3001C(F)(F)(F)S(=O)(=O)[O-].[Na+]": 373,
    "CC[N+](CC)(CC)CC.[O-]Cl(=O)(=O)=O\u3001[Mg+2].[Cl-].[Cl-]": 374,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]Cl(=O)(=O)=O\u3001[Na+].[Cl-]": 375,
    "Cl[Mg]Cl": 376,
    "CC[N+](CC)(CC)(CC)CC.F[P-](F)(F)(F)(F)F": 377,
    "CCCCCCCCCCCCCCCC[N+](C)(C)C.[Br-]": 378,
    "C(F)(F)(F)S(=O)(=O)O.C(F)(F)(F)S(=O)(=O)O.[Mn]": 379,
    "\tCCCCN+(CCCC)CCCC.[I-]": 380,
    "benzyltrimethylammonium chloride ": 381,
    "[I-].N(CCCC)(CCCC)(CCCC)CCCC": 382,
    "[N+](CCCC)(CCCC)(CCCC)(CCCC).[B-](F)(F)(F)F": 383,
    "IC=1C=CC=CC1": 384,
    "[N+](CCCC)(CCCC)(CCCC)(CCCC).[O-]C(=O)C": 385,
    "[IH-].CCCC[N+](CCCC)(CCCC)CCCC": 386,
    "C(C(C(C(C)C)C)C)N+.[PF6-]": 387,
    "CC(C)(C)c1ccc(S(=O)(=O)O)cc1.[Na]": 388,
    "Tetrabutylammonium hexafluorophosphate": 389,
    "C1=CC=C(CCN+(C)C)C=C1.[Cl-]": 390,
    "CCN+(CC)CC.[Cl-]": 391,
    "[NH4+].[P-](F)(F)(F)(F)(F)F": 392,
    "[N+](=O)([O-])[O-].[Na+]": 393,
    "Cc1cccc(S(=O)O)c1.[Na]": 394,
    "\t[Li+].[Cl-]": 395,
    "5.6HF stock solution": 396,
    "Li+.[Br-]": 397,
    "CC(=O)[O-].[Na+]": 398,
    "K+.[I-]": 399,
    "[Na+].[Na+].[O-]S(=O)(=S)[O-]": 400,
    "Na+.[O-]S(=O)(=O)C1=CC=C(CH3)C=C1": 401,
    "CC1=CC=C(C=C1)S(=O)(=O)O.O": 402,
    "[Na+].[Na+].O=S(OS(=O)O)[O-]": 403,
    "[PhCH2N+](C)(C)C.[Cl-]": 404,
    "CCCCN+(CCCC)CCCC.FB-(F)F": 405,
    "C(C(C(C(C)C)C)C)N+.[Cl-]": 406,
    "CCCC(C(=O)O)": 407,
    "nBu4NHSO4": 408,
    "CCCCN+(CCCC)CCCC.[PF6-]": 409,
    "F.F": 410,
    "F.F.F.F.F.F.F": 411,
    "nBu4NBF4": 412,
    "[Na+].[Na+].O=S(=O)OS(=O)[O-]": 413,
    "C=CCN(CC=C)C(=O)CC(=O)O.[K]": 414,
    "[Cl-].[Na+]": 415,
    "[Br-].[K+]": 416,
    "[N+](CC)(CC)CC.Br-": 417,
    " [Li+].[Br-]": 418,
    "CCCCCCCCN+(CCCCCCCC)CCCCCCCC.[I-]": 419,
    "[K+].[F-]P(F)(F)(F)(F)F": 420,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.[O-]S(=O)(=O)O": 421,
    "CC(=O)[O-].O.[Na+].O.O.O": 422,
    "CCCC[N+](CCCC)(CCCC)CCCC.[ClO4-]": 423,
    "[K+].[P-](F)(F)(F)(F)(F)F": 424,
    "[Na+].[Na+].O=S(OS(=O)[O-])[O-]": 425,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)(F)(F)F": 426,
    "CC1=CC=C(C=C1)S(=O)[O-].[Na+]": 427,
    "IC1=CC=C(C)C=C1": 428,
    "[Br-].C(C)[N+](CC)(CC)CC": 429,
    "[Na+].[O]S(=O)(=O)C(F)(F)F": 430,
    "\tK+.[Br]-": 431,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.O=S(=O)([O-])C(F)(F)F": 432,
    "[N+](CCCC)(CCCC)(CCCC)(CCCC).[Br-]": 433,
    "CCCN+(CCC)CCC.[Br]-": 434,
    "CCCC[N+](CCCC)(CCCC)CCCC.[PF6]-": 435,
    "C(F)(F)(F)S(=O)(=O)[O-].[Na+]": 436,
    "C(CCCC)[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 437,
    "FC(S(=O)(=O)[O-])(F)F.C(CCC)[N+](CCCC)(CCCC)CCCC": 438,
    "CS(=O)C": 439,
    "C(C(=O)O)C(F)(F)F": 440,
    "[Na+].[O-]Cl(=O)(=O)=O": 441,
    "Cl(=O)(=O)=O.[Na+]": 442,
    "[Cl-].[N+](C)(C)(C)Cc1ccccc1": 443,
    "O=C([O-])O.[K+]": 444,
    "CCOC(=O)C(=O)O.[K]": 445,
    "K+.[HCO3]-": 446,
    "O=C([O-])CC(C)C.CCCC[N+](CCCC)(CCCC)CCCC": 447,
    "CCC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 448,
    "CC(C)(C)CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 449,
    "CCCC[N+](CCCC)(CCCC)CCCC.C([2H])([2H])([2H])C(=O)[O-]": 450,
    "[N+](CCCC)(CCCC)(CCCC).[O-]Cl(=O)(=O)=O": 451,
    "C(CCCC)[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 452,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.Cl(=O)(=O)(=O)[O-]": 453,
    "C1=CC=[N+]C=C1.[Br-]": 454,
    "C1=CC=NC=C1.[Br-]": 455,
    "Br.N1=CC=CC=C1": 456,
    "[NH+]1C=CC=C1.[Br-]": 457,
    "tetrabutylammonium tetrafluoroborate": 458,
    "[Cl-].[N+](C)(C)Cc1ccccc1": 459,
    "O=C([O-])O": 460,
    "C([O-])(O)=O.[Na+]": 461,
    "CCCCC#[C-][B+3]([F-])([F-])[F-].[K+]": 462,
    "[N+](C)(C)(C)C.[BF4-]": 463,
    "K.I": 464,
    "[HN+](CC)(CC)CC.[F-].[HF]": 465,
    "[B-](F)(F)(F)F.N(CC)(CC)(CC)CC": 466,
    "CC(F)(F)S(=O)O.[Na]": 467,
    "CC(=O)[O-].[N+](CCCC)(CCCC)(CCCC)CCCC": 468,
    "CC[N+](CC)CC.F.F.F.[F-]": 469,
    "F[P-](F)(F)(F)(F)F.C(CCC)N1C=[N+](C=C1)C": 470,
    "Li+].[O-]Cl(=O)(=O)=O": 471,
    "[N+](CCCC)(CCCC)(CCCC)CCCC.O=C([O-])C": 472,
    "CCCCN+(CCCC)CCCC.[O-]C(=O)C": 473,
    "[Li+].[O-][Cl](=O)(O)O": 474,
    "F[B-](F)(F)F.C[N+](C)(C)C": 475,
    " [Li].O=Cl(=O)(=O)O": 476,
    "O.O.O.O.O.O.O.O.O.[Fe+3].O[N+]([O-])=O.O[N+]([O-])=O.O[N+]([O-])=O": 477,
    "CCN1C=C[N+](=C1)C.F[P-](F)(F)(F)(F)F": 478,
    "C[N+](C)(C)C.[Cl-]": 479,
    "CCCCN+(CCCC)CCCC.[I-]": 480,
    "CCCC[C](C)(C)N.[BF4-]": 481,
    "C(C(F)(F)F)(F)O": 482,
    "[Br-].C[N+](C)(C)C": 483,
    "Na+.[O-]S(=O)(=O)C(F)(F)F": 484,
    "[Na].O=S(O)C1CCC(CC1)C": 485,
    "CCCC[N+](CCCC)(CCCC)CCCC.[F][B-](F)(F)F": 486,
    "CC1=CC=C(C=C1)S(=O)(=O)O": 487,
    "[Li+].[Br-],[Fe].O=N(=O)O": 488,
    "C(F)(F)(F)S(=O)[O-].[Na+]": 489,
    " CC[N+](CC)(CC)CC.[B-](F)(F)(F)F": 490,
    "C(=[N-])=S.[K+]": 491,
    "[Li+].[CI-]": 492,
    "O=S(=O)([O-])c1ccc(C)cc1.[Na+]": 493,
    " CC[N+](CC)(CC)CC.[Br-]": 494,
    " CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 495,
    " C(F)(F)(F)S(=O)[O-].[Na+]": 496,
    "CCCC[N+](CCCC)(CCCC)CCCC.[B-](c1c(F)c(F)c(F)c(F)c1F)(c2c(F)c(F)c(F)c(F)c2F)(c3c(F)c(F)c(F)c(F)c3F)c4c(F)c(F)c(F)c(F)c4F": 497,
    "CCC(=O)[O-].[NH4+]": 498,
    " CCCC[N+](CCCC)(CCCC)CCCC.[O-][Cl+3]([O-])([O-])[O-]": 499,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]Cl(=O)(=O)=O ": 500,
    "C[N+](CC)(CC)CC.[F-]": 501,
    "[Li+].[F-][P+5]([F-])([F-])([F-])([F-])[F-]": 502,
    "ClCCCl": 503,
    "CC(C)(C)C(=O)[O-].[Na+].O": 504,
    "CCCCN+CCCC.FP(F)(F)(F)(F)[F-]": 505,
    "c1ccc2scnc2c1": 506,
    "[F-].[N+](CC)(CC)CC": 507,
    "[F-]B([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 508,
    "[Br-].[Li+]": 509,
    "[K].N#C[SeH]": 510,
    "CCCC[N+](CCCC)(CCCC)CCCC.[I-]\t": 511,
    "Na+.[I-];CCCCN+CCCC.FB-(F)F": 512,
    "\tK+.[Br-]": 513,
    "Na+.[Br-]": 514,
    "CC(O)=O": 515,
    "N#CC": 516,
    "[Na+].I-": 517,
    "[K+].O=[Os-2](=O)(=O)=O.O": 518,
    "[K+].[Se-]C#N": 519,
    "[I-].[NH4+]": 520,
    "[Na].O=S(O)C1CC1": 521,
    "FC(F)(F)C(O)C(F)(F)F": 522,
    "C[N+](C)(C)C.[Br-]": 523,
    "O=S([O-])C1=CC=C(C)C=C1.[Na+]": 524,
    "[P-](F)(F)(F)(F)(F)F.[K+]": 525,
    "C(=O)(O)[O-].[K+].[Na+].[Na+].[O-]C([O-])=O.C(=O)([O-])=O.[K+].[K+]": 526,
    "[K+].[O-]C(=O)O": 527,
    "K+.[O-]C(=O)O": 528,
    "[Cl-].C[N+](C)(C)Cc1ccccc1": 529,
    "[Li+].C[O-]": 530,
    "[I-].N(CC)(CC)(CC)CC": 531,
    "\t[S-]C#N.[NH4+]": 532,
    "polysorbate 20": 533,
    "[Li+].FC(F)(F)S(=O)(=O)[O-]": 534,
    "C1=CC=C(C(=C1)C(=O)CN)F": 535,
    " [Li+].[O-][Cl+3]([O-])([O-])[O-]": 536,
    "[NH4+].[Br-]": 537,
    "[Na].O=C(O)O\uff1bO=S(=O)(O)O": 538,
    "OO": 539,
    "Mg+2.[Cl-].[Cl-]": 540,
    "aq. KNO3": 541,
    "[Li+].[Br-]\u3001O.O.O.O.O.O.O.O.O.[Fe+3].O[N+]([O-])=O.O[N+]([O-])=O.O[N+]([O-])=O": 542,
    "C1=CC=C(C=C1)S(=O)[O-]": 543,
    "[Na+].[Na+].[O-]C([O-])=O": 544,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F\u3001[Na+].[Br-]": 545,
    "null": 546
  },
  "solvent": {
    "CC#N": 1,
    "O": 2,
    "C(Cl)Cl": 3,
    "CO": 4,
    "CN(C)C=O": 5,
    "OC(C(F)(F)F)C(F)(F)F": 6,
    "ClCCCl": 7,
    "N#CC": 8,
    "C(C(F)(F)F)(C(F)(F)F)O": 9,
    "C(C(F)(F)F)O": 10,
    "CC(C)=O": 11,
    "C1CCOC1": 12,
    "C[S](C)=O": 13,
    "CC(=O)C": 14,
    "COCCOC": 15,
    "CC(O)=O": 16,
    "CC(C)(C)OC": 17,
    "CC(=O)N(C)C": 18,
    "C1COCCO1": 19,
    "ClCCl": 20,
    "CCOC(=O)C": 21,
    "C1=CC=C(C=C1)C(F)(F)F": 22,
    "CS(=O)C": 23,
    "C[N+](=O)[O-]": 24,
    "C(=O)(C(F)(F)F)O": 25,
    "CCO": 26,
    "CCOCC": 27,
    "CN1CCCC1=O": 28,
    "CC(C)(C)O": 29,
    "O=CN(C)C": 30,
    "O=C(C)C": 31,
    "FC(F)(F)C(O)C(F)(F)F": 32,
    "CC(=O)O": 33,
    "ClC(Cl)Cl": 34,
    "OC=O": 35,
    "CC(=O)OC(C)=O": 36,
    "OC": 37,
    "CCCCO": 38,
    "FC(F)(F)CO": 39,
    "O1CCCC1": 40,
    "O=S(C)C": 41,
    "C(=O)O": 42,
    "[H+].[OH-]": 43,
    "CCC(C)(C)O": 44,
    "O=C(O)C": 45,
    "O(C)CCOC": 46,
    "Cc1ccccc1": 47,
    "O=C(N(C)C)C": 48,
    "CN1CCN(C)C1=O": 49,
    "COC(C)(C)C": 50,
    "CCCCCC": 51,
    "O=N(=O)C": 52,
    "O1CCOCC1": 53,
    "FC(F)(F)C=1C=CC=CC1": 54,
    "C(Cl)(Cl)Cl": 55,
    "C1CCCCC1": 56,
    "CCCO": 57,
    "FC(C(C(F)(F)F)O)(F)F": 58,
    " [H+].[OH-]": 59,
    "O=C(O)C(F)(F)F": 60,
    "O(CC)CC": 61,
    "CC(C)O": 62,
    "O=C1N(C)CCC1": 63,
    "OCC(F)(F)F": 64,
    "[2H]C([2H])(Cl)Cl": 65,
    "C(CCl)Cl": 66,
    "[2H]C([2H])([2H])C#N": 67,
    "O=C(OCC)C": 68,
    "OC(C)(C)C": 69,
    "C(C)#N": 70,
    "CN(C=O)C": 71,
    "N#CC ": 72,
    "OC(C)C": 73,
    "FC(F)(F)c1ccccc1": 74,
    "CC(C(F)(F)F)(C(F)(F)F)O": 75,
    "O1CCCC1\t": 76,
    "O(C)C(C)(C)C": 77,
    "[18OH2]": 78,
    " N#CC": 79,
    "C(Cl)(Cl)([2H])[2H]": 80,
    "CC1=CC=CC=C1": 81,
    "CN1CCCN(C1=O)C": 82,
    "[2H]C(Cl)(Cl)Cl": 83,
    "CN1CCN(C1=O)C": 84,
    "CCCCCO": 85,
    "C(CO)O": 86,
    "CCC(O)=O": 87,
    "O=C(O)CC": 88,
    " O1CCCC1": 89,
    "CC(=O)OC(=O)C": 90,
    "O=C1N(C)CCN1C": 91,
    "ClC(Cl)(Cl)Cl": 92,
    "C[N](=O)[O]": 93,
    "C(Br)Br": 94,
    "O=C(OC(=O)C)C": 95,
    "CN(C)C=O ": 96,
    "OC(C(F)(F)F)C(F)(F)F  ": 97,
    "C[S](C)=O  ": 98,
    "[NH4+].[I-]": 99,
    "OCC": 100,
    "FC(CO)(F)F": 101,
    "C(C(F)F)O": 102,
    "C(CCC)O": 103,
    "[N+](=O)([O-])C": 104,
    "CC(=O)CC": 105,
    "[C-]#[O+]": 106,
    "O=CO": 107,
    "CCCCN1C=C[N+](=C1)C.F[P-](F)(F)(F)(F)F": 108,
    "O=[N+]([O-])C": 109,
    "CCC(C)=O": 110,
    "OC(C)(C)CC": 111,
    "CCC[N+]([O-])=O": 112
  },
  "reagent": {
    "O": 1,
    "C(=O)(C(F)(F)F)O": 2,
    "Cl": 3,
    "C[Si](C)(C)N=[N+]=[N-]": 4,
    "O=O": 5,
    "CC(=O)O": 6,
    "C(=O)([O-])[O-].[Na+].[Na+]": 7,
    "CCN(CC)CC": 8,
    "CC(=O)[O-].[Na+]": 9,
    "[K+].[K+].[O-]C([O-])=O": 10,
    "CC(O)=O": 11,
    "OC(C(F)(F)F)C(F)(F)F": 12,
    "C(=O)(O)[O-].[Na+]": 13,
    "[O-]P(=O)([O-])[O-].[K+].[K+].[K+]": 14,
    "[Na+].[Cl-]": 15,
    "[N-]=[N+]=[N-].[Na+]": 16,
    "[Na+].[Br-]": 17,
    "CCN(CC)CC.F.F.F": 18,
    "[NH4+].[I-]": 19,
    "Cc1ccc(I)cc1": 20,
    "Cc1cccc(C)n1": 21,
    "C(=O)[O-].[Na+]": 22,
    "C1CCN2CCCN=C2CC1": 23,
    "ClCCCl": 24,
    "[OH-].[Na+]": 25,
    "C1CN2CCN1CC2": 26,
    "C(F)(F)(F)S(=O)(=O)O": 27,
    "CCOC(=O)C": 28,
    "CC1(CCCC(N1[O])(C)C)C": 29,
    "[Na+].[I-]": 30,
    "C(=O)(C(F)(F)F)[O-].[Na+]": 31,
    "C(=O)([O-])[O-].[K+].[K+]": 32,
    "[B-](F)(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 33,
    "[K+].CC(C)(C)[O-]": 34,
    "[Na].O=C(O)O": 35,
    "[O-]S(=O)(=S)[O-].[Na+].[Na+]": 36,
    "[Mg++].[Cl-].[Cl-]": 37,
    "CC(=O)OC(C)=O": 38,
    "CC(C)C(=O)O": 39,
    "COC(=O)c1ccc2cc(ccc2c1)C(=O)OC": 40,
    "Cc1ccc(cc1)[S](O)(=O)=O": 41,
    "C1CC(=O)N(C1=O)Cl": 42,
    "OP(=O)([O-])[O-].[K+].[K+]": 43,
    "[Li+].[Br-]": 44,
    "N": 45,
    "[Na+].CC(C)(C)C([O-])=O": 46,
    "OS(=O)[O-].[Na+]": 47,
    "C1CC(=O)N(C1=O)Br": 48,
    "[Na+].[Na+].[O-]C([O-])=O": 49,
    "[K].O=C(O)O": 50,
    "C(=O)([O-])[O-].[Cs+].[Cs+]": 51,
    "NCCCN": 52,
    "O=S(=O)(F)Cl": 53,
    "C": 54,
    "C1=CC=C(C=C1)N(C2=CC=CC=C2)C3=C(C(=C(C(=C3C#N)N(C4=CC=CC=C4)C5=CC=CC=C5)N(C6=CC=CC=C6)C7=CC=CC=C7)N(C8=CC=CC=C8)C9=CC=CC=C9)C#N": 55,
    "C(F)(F)(F)S(=O)(=O)[O-].[Na+]": 56,
    "CS(=O)(=O)O": 57,
    "CCc1ccc(cc1)B(O)O": 58,
    "C1=CC=C2C(=C1)SC3=CC=CC=C3S2": 59,
    "O=C(O)C(F)(F)F": 60,
    "B(F)(F)F.CCOCC": 61,
    "CC[Si](CC)CC": 62,
    "BrCCBr": 63,
    "C1CCC2=NCCCN2CC1": 64,
    "CCN(CC)CC.[F-]": 65,
    "CC(C)(C)C(=O)O": 66,
    "CC(C)(C)O.[K]": 67,
    "B(B(O)O)(O)O": 68,
    "B(C1=C(C(=C(C(=C1F)F)F)F)F)(C2=C(C(=C(C(=C2F)F)F)F)F)C3=C(C(=C(C(=C3F)F)F)F)F": 69,
    "C(=O)([O-])[O-].[Ca+2]": 70,
    "N(=O)[O-].[Na+]": 71,
    "[N+](=O)([O-])[O-].[Na+]": 72,
    "[Mg+2].[Cl-].[Cl-]": 73,
    "COC(=O)c1ccc(cc1)C(=O)OC": 74,
    "c1ccncc1": 75,
    "C1=CC(=CC=C1N(C2=CC=C(C=C2)Br)C3=CC=C(C=C3)Br)Br": 76,
    "ClC(Cl)(Cl)C(Cl)(Cl)Cl": 77,
    "CC(C)(C)ON=O": 78,
    "O.O.O.O.O.O.O.O.O.[Fe+3].O[N+]([O-])=O.O[N+]([O-])=O.O[N+]([O-])=O": 79,
    "[Pt]": 80,
    "CC1=CC=C(C=C1)[P+](=O)C2=CC=C(C=C2)C": 81,
    "[B-](F)(F)(F)F.[B-](F)(F)(F)F.C1C[N+]2(CC[N+]1(CC2)CCl)F": 82,
    "C(C(F)(F)F)(C(F)(F)F)O": 83,
    "FC(F)(F)c1ccncc1": 84,
    "C[Si](C)(C)C#N": 85,
    "C(=O)(O)[O-].[K+]": 86,
    "[Fe++].[cH-]1cccc1.[cH-]2cccc2": 87,
    "OP(=O)(O)[O-].[K+]": 88,
    "NS(=O)(=O)N": 89,
    "[Na].O=C(O)C": 90,
    "CC1=CC=C(I)C=C1": 91,
    "CC1=CC(=C(C(=C1)OC)I)OC": 92,
    "OCCN(CCO)CCO": 93,
    "[NH4+].[Cl-]": 94,
    "[O-]S(=O)S(=O)(=O)[O-].[K+].[K+]": 95,
    "C(Br)Br": 96,
    "ClCl": 97,
    "ClC(Cl)(Cl)C#N": 98,
    "[K].O=P(O)(O)O": 99,
    "[N-]=[N+]=N[Si](C)(C)C": 100,
    "[N-]=[N+]=N[Na]": 101,
    "OP(=O)([O-])[O-].[Na+].[Na+]": 102,
    "Oc1ccccc1[N+]([O-])=O": 103,
    "CCN(C(C)C)C(C)C": 104,
    "CCCC[N+](CCCC)(CCCC)CCCC.[Br-]": 105,
    "CC(C)(C)C1=NC(=CC=C1)C(C)(C)C": 106,
    "CCN(CC)CC.F.F.F.F.F": 107,
    "COC1=CC=C(C=C1)I": 108,
    "B(C1=CC=CC=C1)(O)O": 109,
    "[Li+].O.O.O.[O-][Cl](=O)(=O)=O": 110,
    "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 111,
    "[Na]Cl": 112,
    "O=C(O)C": 113,
    "[O-]S(=O)[O-].[Na+].[Na+]": 114,
    "CCCC[N+](CCCC)(CCCC)CCCC.[O-]Cl(=O)(=O)=O": 115,
    "[Na]Br": 116,
    "ClCC(Cl)(Cl)Cl": 117,
    "F.N=1C=CC=CC1": 118,
    "COC(=O)C1=CC=C(C=C1)C(=O)OC": 119,
    "F.N(CC)(CC)CC": 120,
    "[NH4+].F[P-](F)(F)(F)(F)F": 121,
    "C1=CC=C(C=C1)[SiH3]": 122,
    "[H+].[Br-]": 123,
    "CN(C)C=O": 124,
    "[Na]O": 125,
    "C(F)(F)(F)S(=O)[O-].[Na+]": 126,
    "[Li+].[O-]Cl(=O)(=O)=O": 127,
    "CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 128,
    "[Li+].[Cl-]": 129,
    "[K+].[Br-]": 130,
    "C1CNC2=NCCCN2C1": 131,
    "[Na].O=C(O)C(C)(C)C": 132,
    "[B-](F)(F)(F)F.CC[N+](CC)(CC)CC": 133,
    "CC[SiH](CC)CC": 134,
    "[Fe].O=N(=O)O": 135,
    "N=C(c1ccccc1)c2ccccc2": 136,
    "[Na].O=CO": 137,
    "C(C(Cl)(Cl)Cl)(Cl)(Cl)Cl": 138,
    "Cl[Mg]Cl": 139,
    "[18OH2]": 140,
    "CS(=O)C": 141,
    "[Na].O=S(O)O": 142,
    "C1=CC=C2C(=C1)SC3=CC=CC=C3S2=O": 143,
    "CC1=C(N=C(C(=N1)C)C=[N+](C(C)(C)C)[O-])C": 144,
    "c1ccc(cc1)P(c2ccccc2)c3ccccc3": 145,
    "C(CBr)O": 146,
    "[Na]I": 147,
    "I[NH4]": 148,
    "C1=CC=NC=C1.F": 149,
    "CC(C)(C)C(=O)[O-].[Na+]": 150,
    "N1=C2N(CCC1)CCCCC2": 151,
    "[O-]S(=O)S(=O)(=O)[O-].[Na+].[Na+]": 152,
    "BrC(Br)(Br)Br": 153,
    "OS(=O)(=O)O": 154,
    "CC1=CC(=C(C(=C1)C(C)(C)C)O)C(C)(C)C": 155,
    "OC=O": 156,
    "Ic1ccccc1": 157,
    "OB(O)B(O)O": 158,
    "C1=CC=C2C(=C1)C(=O)[N-]C2=O.[K+]": 159,
    "CCCC[N+](CCCC)(CCCC)CCCC.CC1=CC=C(C=C1)S(=O)(=O)[O-]": 160,
    "F[P-](F)(F)(F)(F)F.[K+]": 161,
    "CCCC[N+](CCCC)(CCCC)CCCC.[OH-]": 162,
    "[Li]Br": 163,
    "[Na].O=N(=O)O": 164,
    "C1=CC=C2C(=C1)C=CC3=CC=CC=C32": 165,
    "C1=CC=C(C=C1)C2=NN([N+](=N2)C3=CC=CC=C3)C4=CC=CC=C4.[Cl-]": 166,
    "[Li+].C(F)(F)(F)S(=O)(=O)[O-]": 167,
    "[F-][B+3]([F-])([F-])O(CC)CC": 168,
    "C[Si](C)(C)Cl": 169,
    "N=1C(=CC=CC1C)C": 170,
    "O=P(C1=CC=C(C=C1)C)C2=CC=C(C=C2)C": 171,
    "[Na].O=NO": 172,
    "[O-]S(=O)(=O)OOS(=O)(=O)[O-].[K+].[K+]": 173,
    "COC(=O)C1=CC2=C(C=C1)C=C(C=C2)C(=O)OC": 174,
    "O=C(OC(=O)C)C": 175,
    "O=C(OCC)C": 176,
    "O=S(=O)(O)C(F)(F)F": 177,
    "N(CC)(CC)CC": 178,
    "IC1=CC=C(C=C1)C": 179,
    "N12CCN(CC1)CC2": 180,
    "[H+].[Cl-]": 181,
    "[BH4-].[Na+]": 182,
    "OC(=O)c1ccccc1": 183,
    "FC=1C(F)=C(F)C(B(C=2C(F)=C(F)C(F)=C(F)C2F)C=3C(F)=C(F)C(F)=C(F)C3F)=C(F)C1F": 184,
    "C(F)(F)(F)S(=O)(=O)O.[Cu]": 185,
    "O[S](Cl)(=O)=O": 186,
    "C1CCOC1": 187,
    "C1=CC=C2C(=C1)C(=O)N(C2=O)O": 188,
    "C(C(Cl)(Cl)Cl)Cl": 189,
    "[Cs].O=C(O)O": 190,
    "O=C(OC)C=1C=CC2=CC(=CC=C2C1)C(=O)OC": 191,
    "C(=O)O": 192,
    "C1C=CCC=C1": 193,
    "[Cu+].[Br-]": 194,
    "[Si]": 195,
    "O=S(=O)(O)C1=CC=C(C=C1)C": 196,
    "N#CC=1C(=C(C#N)C(=C(C1N(C=2C=CC=CC2)C=3C=CC=CC3)N(C=4C=CC=CC4)C=5C=CC=CC5)N(C=6C=CC=CC6)C=7C=CC=CC7)N(C=8C=CC=CC8)C=9C=CC=CC9": 197,
    "O=P(O)(O)O.N": 198,
    "CC[N+](CC)(CC)S(=O)(=O)/N=C(\\[O-])/OC": 199,
    "[H+].[OH-]": 200,
    "CC(C)N=C=NC(C)C": 201,
    "[Na].O=C(O)C(F)(F)F": 202,
    "Br": 203,
    "O=C(O)C(C)C": 204,
    "OB(O)C1=CC=C(C=C1)CC": 205,
    "FC(F)(F)C(O)C(F)(F)F": 206,
    "O=C(OC)C1=CC=C(C=C1)C(=O)OC": 207,
    "BrC1=CC=C(C=C1)N(C2=CC=C(Br)C=C2)C3=CC=C(Br)C=C3": 208,
    "c1ccncc1.F.F.F.F.F.F.F.F.F": 209,
    "C[S](C)=O": 210,
    "[F-].[Cs+]": 211,
    "[H+].[B-](F)(F)(F)F": 212,
    "CN(C)CCN(C)C": 213,
    "[I-].CC[N+](CC)(CC)CC": 214,
    "CO": 215,
    "[CH]=12[CH]3=[CH]4[CH-]5[CH]1[Fe+2]23678945[CH]=%10[CH]9=[CH]8[CH-]7[CH]%106": 216,
    "O=N(=O)C=1C=CC=CC1O": 217,
    "CC(C)(C)C1=CC=C(C=C1)C(=O)OC": 218,
    "C[N+](C)(C)C.[I-]": 219,
    "[NH4+].[NH4+].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[Ce+4]": 220,
    "C1=CC=C(C=C1)S(=O)(=O)N(F)S(=O)(=O)C2=CC=CC=C2": 221,
    "CC(=O)OI(C1=CC=CC=C1)OC(=O)C": 222,
    "CC(C)(C)OO": 223,
    "CC(=O)[O-].CC(=O)[O-].CC(=O)[O-].[Mn+3]": 224,
    "[N+](=O)([O-])[O-].[Ag+]": 225,
    "CC(C)(C)OOC(C)(C)C": 226,
    "[K].OC(C)(C)C": 227,
    "O([2H])[2H]": 228,
    "[Na].O=S(O)S(=O)(=O)O": 229,
    "CC[N+](CC)(CC)CC.[O-]Cl(=O)(=O)=O": 230,
    "[Na+].[Na+].[O-]C(=O)[O-]": 231,
    "IC1=C(OC)C=C(C=C1OC)C": 232,
    "[OH-].C[N+](C)(C)Cc1ccccc1": 233,
    "CCCC[N+](CCCC)(CCCC)CCCC.[F-]": 234,
    "C(Cl)(Cl)(Cl)Cl": 235,
    "[Ca].O=C(O)O": 236,
    "[Fe+3].[O-][N+](=O)[O-].[O-][N+](=O)[O-].[O-][N+](=O)[O-]": 237,
    "[NH4+].[O-][Cl](=O)(=O)=O": 238,
    "II": 239,
    "C(Cl)Cl": 240,
    "CC(=O)[O-].[K+]": 241,
    "COC(=O)C1=CC2=CC=CC=C2C=C1": 242,
    "[Mn++].CC([O-])=O.CC([O-])=O": 243,
    "CCCCO": 244,
    "O=C(CC(=O)c1ccccc1)c2ccccc2": 245,
    "CC[N+](CC)(CC)CC.[Cl-]": 246,
    "C[O-].[Na+]": 247,
    "O=C([N-]S(=O)(=O)[N+](CC)(CC)CC)OC": 248,
    "C(C)(=O)O": 249,
    "[Li+].[O-][Cl](=O)(=O)=O": 250,
    "[OH-].CCCC[N+](CCCC)(CCCC)CCCC": 251,
    "[K+].[O-][C+](=O)[O-]": 252,
    "[Cs+].[Cs+].[O-]C([O-])=O": 253,
    "C1=CC(=CC(=C1)Cl)C(=O)OO": 254,
    "C(#N)C1=C(C(=O)C(=C(C1=O)Cl)Cl)C#N": 255,
    "CCCC[N+](CCCC)(CCCC)CCCC.CC([O-])=O": 256,
    "[OH-].[K+]": 257,
    "C1=CC=C(C=C1)[SiH2]C2=CC=CC=C2": 258,
    "CN(C)c1cc[nH+]cc1": 259,
    "C1C[N+]2(CC[N+]1(CC2)S(=O)[O-])S(=O)[O-]": 260,
    "OC(=O)C(F)(F)F": 261,
    "COC(=O)C1=CC=CC=C1": 262,
    "O=S=O": 263,
    "CC[N+](CC)(CC)CC.F.F.F.[F-]": 264,
    "FC(F)(F)C=1C=CN=CC1": 265,
    "CC(=C(OC)O[Si](C)(C)C)C": 266,
    "N1=C2NCCCN2CCC1": 267,
    "[Na+].CC(C)(C)[O-]": 268,
    "C[Si](C)(C)I": 269,
    "CC[N+](CC)(CC)CC.F[P-](F)(F)(F)(F)F": 270,
    "CCc1ccc(B(O)O)cc1": 271,
    "C1=CC=C(C=C1)[Se][Se]C2=CC=CC=C2": 272,
    "[Na].O=S(=O)(O)S": 273,
    "[K+].[O-]C(C)(C)C": 274,
    "N(c1ccc(Br)cc1)(c2ccc(Br)cc2)c3ccc(Br)cc3": 275,
    "[Na].O=S(=O)(O)C(F)(F)F": 276,
    "Cl[NH4]": 277,
    "C1COCCOCCOCCOCCOCCO1": 278,
    "CC[N+](CC)(CC)CC.CC1=CC=C(C=C1)S(=O)(=O)[O-]": 279,
    "OO": 280,
    "C1=CC=C(C=C1)C(=O)O": 281,
    "[HH]": 282,
    "[NH4+].[NH4+].O[P]([O-])([O-])=O": 283,
    "[Mg]": 284,
    "C(Br)(Br)(Br)Br": 285,
    "FC(C(=O)O)(F)F": 286,
    "C[Si](C)(C)[Si](O)([Si](C)(C)C)[Si](C)(C)C": 287,
    "O=C1N(Br)C(=O)CC1": 288,
    " [H+].[Cl-]": 289,
    "[K+].[O-]C(=O)c1ccccc1": 290,
    "[K+].O=C1[N-]C(=O)c2ccccc12": 291,
    "[NH4+].[OH-]": 292,
    "O=S(=O)(N)N": 293,
    "[F-][P+5]([F-])([F-])([F-])([F-])[F-].[NH4+]": 294,
    "N#CC": 295,
    "[K].O=S(O)S(=O)(=O)O": 296,
    "C=1C=CC(=CC1)P(C=2C=CC=CC2)C=3C=CC=CC3": 297,
    "[Na+].[O-]C(=O)[O-]": 298,
    "[Br-].CCCC[N+](CCCC)(CCCC)CCCC": 299,
    "[Na].O=P(O)(O)O": 300,
    "Br[Mg]Br": 301,
    "CCCCCCCCCCC=C": 302,
    "C[N+](=O)[O-]": 303,
    "[Li+].[I-]": 304,
    "CS(=[18O])C": 305,
    "[K+].[I-]": 306,
    "C1CCN(CC1)N": 307,
    "C1=CC=C(C(=C1)C(=O)O)C(=O)O[O-].C1=CC=C(C(=C1)C(=O)O)C(=O)O[O-].[Mg+2]": 308,
    "CC[C@H]1CN2CC[C@H]1C[C@@H]2[C@H](C3=C4C=C(C=CC4=NC=C3)OC)OC5=NN=C(C6=CC=CC=C65)O[C@H]([C@H]7C[C@@H]8CCN7C[C@@H]8CC)C9=C1C=C(C=CC1=NC=C9)OC": 309,
    "[Hf]": 310,
    "CN(C)C(=NC1CCCCC1)NC2CCCCC2.CN(C)C(=NC1CCCCC1)NC2CCCCC2": 311,
    "O=[N+]([O-])C1=CC=C(I)C=C1": 312,
    "FC(F)(F)C1=CC=C(I)C=C1": 313,
    "COC1=CC=C(I)C=C1": 314,
    "CN(C1CCCCC1)C2CCCCC2": 315,
    "C(CO)NN": 316,
    "[Mn]": 317,
    "[Zn]": 318,
    "CN(C)C(=C(N(C)C)N(C)C)N(C)C": 319,
    "C(F)(F)S(=O)[O-].C(F)(F)S(=O)[O-].[Zn+2]": 320,
    "C(F)(F)S(=O)[O-].[Na+]": 321,
    "[B-](F)(F)(F)F.[CH-]1C=CC=C1.[CH-]1C=CC=C1.[Fe+3]": 322,
    "CC1=NC(=CC=C1)C": 323,
    "C1=CN(C=N1)C(=O)N2C=CN=C2": 324,
    "c1ccc(nc1)c2ccccn2": 325,
    "CC(=O)[O-].[Cs+]": 326,
    "CCNCC": 327,
    "C1=CC=NC=C1": 328,
    "C1CN2CCC1CC2": 329,
    "[Cs+].[Cs+].[O-]C(=O)[O-]": 330,
    "ClC(Cl)(Cl)Cl": 331,
    "[Na+].[Na+].O=C(O)O": 332,
    "[K+].O=[W+4]1234[O-2][W+4]567(=O)[O-2][W+4]89(=O)([O-2]1)[O-2][W+4]%10%11%12(=O)[O-2][W+4]%13%14(=O)([O-2]2)[O-2][W+4]%15%16(=O)([O-2]3)[O-2][W+4]%17%18(=O)([O-2]5)[O-2][W+4]%19%20(=O)([O-2]6)[O-2][W+4]%21(=O)([O-2]8)([O-2]%10)[O-2][W+4]%22%23(=O)([O-2]%19)[O-2][W+4]%24(=O)([O-2]%15)([O-2]%17)[O-2][W+4](=O)([O-2]%13)([O-2]%11)([O-2]%22)[O-2]%14%12[Co+3]([O-2]479)([O-2]%16%18%24)[O-2]%20%21%23": 333,
    "CC(C)CCN": 334,
    "[Na+].[N-]=[N+]=N": 335,
    "O=C1OI(O)C2=CC=CC=C12": 336,
    "CCN(CC)CC.F.F.F.F.F ": 337,
    "O=S([O-])S(=O)(=O)[O-].[Na+].[Na+]": 338,
    "O=P([O-])(O)O.[K+]": 339,
    "O=P([O-])([O-])O.[K+].[K+]": 340,
    "CCC(=O)OC(=O)CC": 341,
    "O=C(OC(=O)CC)CC": 342,
    "[Na+].CC([O-])=O": 343,
    "[K+].[K+].[O-]P(=O)(O)[O-]": 344,
    "BrCCO": 345,
    "CC=1N=C(C)C=CC1=C": 346,
    "O=C(OC)C=1C=CC=CC1": 347,
    "[K].O=C(O)C(C)(C)C": 348,
    "CC(C)[Si](C(C)C)C(C)C": 349,
    "[B-](F)(F)(F)F.C[N+](C)(C)C": 350,
    "F[B-](F)(F)O(CC)CC": 351,
    "CC1=CC=CC=N1C": 352,
    "BrC1=CC=C(N(C2=CC=C(Br)C=C2)C3=CC=C(Br)C=C3)C=C1": 353,
    "CC1=CC(C)=[N+](F)C(C)=C1.[O-]S(=O)(=O)C(F)(F)F": 354,
    "[K+].[OH-]": 355,
    "C=1C=CC(=CC1)[SiH2]C=2C=CC=CC2": 356,
    "CCN(CC)CC.F": 357,
    "Cl[Si](C=1C=CC=CC1)(C=2C=CC=CC2)C=3C=CC=CC3": 358,
    "O=C(C=1C=CC=CC1)CC(=O)C=2C=CC=CC2": 359,
    "O=C(OC)c1ccccc1": 360,
    "[Fe].O=[N+]([O-])[O-]": 361,
    "N1=C2N(CCC1)(CCCCC2)": 362,
    "F[Cs]": 363,
    "[nH]1ccnc1": 364,
    "[N-]=[N+]=NCC(C(F)(F)F)(C(=O)c1ccccc1)O": 365,
    "[B-](F)(F)(F).CCOCC": 366,
    "[Fe+3].[O-]N(=O)(=O)O.[O-]N(=O)(=O)O.[O-]N(=O)(=O)O": 367,
    "[K+].[O-]C(=O)[O-]": 368,
    "B(C1=CC=C(C=C1)CC)(O)O": 369,
    "CC(C)(C)C1NC(CCC1)C(C)(C)C": 370,
    "[Na+].O=S(=O)(O[S](=O)(=O)[O-])C(F)(F)F": 371,
    "C1=CC=C(C=C1)C(=N)C2=CC=CC=C2": 372,
    "S(=O)(=O)(Cl)F": 373,
    "IC1=CC=C(C)C=C1": 374,
    "C(O[2H])([2H])([2H])[2H]": 375,
    "[C]": 376,
    "CC1CC(C(C(C1)OC)I)OC": 377,
    "FC(F)(F)C(=O)O": 378,
    "O=C(O)O.[Na]": 379,
    "OC=1C(=CC(=CC1C(C)(C)C)C)C(C)(C)C": 380,
    "CC(C)(C)c1cc(C)cc(C(C)(C)C)c1O": 381,
    "C(=O)(O)C(F)(F)F": 382,
    "[Na+].[Na+].O=S([O-])S(=O)([O-])O": 383,
    "[K]Br": 384,
    "CC[N+](CC)(CC)CC.[Br-]": 385,
    "N#Cc1c(N(c2ccccc2)c2ccccc2)c(C#N)c(N(c2ccccc2)c2ccccc2)c(N(c2ccccc2)c2ccccc2)c1N(c1ccccc1)c1ccccc1": 386,
    "CCCC[N+](CCCC)(CCCC)CCCC.OS(=O)(=O)[O-]": 387,
    "COC(=O)c1ccccc1": 388,
    "O=S(=O)(O)C": 389,
    "C1CCN2CCCNC2CC1": 390,
    "[Al](Cl)(Cl)Cl": 391,
    "C(F)(F)(F)S(=O)(=O)NS(=O)(=O)C(F)(F)F": 392,
    "C(=O)([O-])[O-].[Ag+].[Ag+]": 393,
    "OCCBr": 394,
    "C1=CC=C(C=C1)C(=O)[O-].[Na+]": 395,
    "O=C1NC(=O)c2ccccc12": 396,
    "CC(C)(C)N=C(N(C)C)N(C)C": 397,
    "[Se]": 398,
    "C=Cc1ccccc1": 399,
    "[Mg++].[Br-].[Br-]": 400,
    "[O-]Cl(=O)(=O)=O.[Na+]": 401,
    "[N+](=O)([O-])[O-].[Fe+3].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-]": 402,
    "C(C)N(CC)CC": 403,
    "C[N+](C)(C)CC1=CC=CC=C1.[Cl-]": 404,
    "[Na+].[O-]C=O": 405,
    "N#Cc1c(N(c2ccccc2)c2ccccc2)c(N(c2ccccc2)c2ccccc2)c(C#N)c(N(c2ccccc2)c2ccccc2)c1N(c2ccccc2)c2ccccc2": 406,
    "COc1ccc(I)cc1": 407,
    "[Na+].[Na+].[O-]P([O-])(=O)O ": 408,
    "C(=NC(C)C)=NC(C)C": 409,
    "O=C1C=2C=CC=CC2C(=O)N1O": 410,
    "CC(C)C[Al]CC(C)C": 411,
    "[C@@H]([C@H](C(=O)[O-])O)(C(=O)[O-])O.[Na+].[K+]": 412,
    "N=C(C=1C=CC=CC1)C=2C=CC=CC2": 413,
    "F[B-](F)(F)F.CCOC(C)C": 414,
    "O=Cl(=O)(=O)O.N": 415,
    "Sc1ccccc1": 416,
    "O=C([O-])C.CCCC[N+](CCCC)(CCCC)CCCC": 417,
    "[N+](=O)([O-])[O-].[NH4+]": 418,
    "C(C(F)(F)F)O": 419,
    "CC(C)NC(C)C": 420,
    "[B-](C1=C(C(=C(C(=C1F)F)F)F)F)(C2=C(C(=C(C(=C2F)F)F)F)F)(C3=C(C(=C(C(=C3F)F)F)F)F)C4=C(C(=C(C(=C4F)F)F)F)F.CCCC[N+](CCCC)(CCCC)CCCC": 421,
    "CCC(=O)[O-].[Na+]": 422,
    "CCO": 423,
    "[NH4+].[Br-]": 424,
    "CC1=CC=C(C=C1)I": 425,
    "C([O-])([O-])=O.[K+].[K+]": 426,
    "O.O.O.O.O.O.O.O.O.O.[Fe+3].[O-][N+](=O)[O-].[O-][N+](=O)[O-].[O-][N+](=O)[O-]": 427,
    "N#CC(Cl)(Cl)Cl": 428,
    "CC1(C)CCCC(C)(C)[N+]1=O": 429,
    "[Cl-].CN(C)c1ccc2nc3ccc(cc3[s+]c2c1)N(C)C": 430,
    "[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[Fe+3]": 431,
    "O=Cl(=O)(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 432,
    "O=C(OC)C=1C=CC=2C=CC=CC2C1": 433,
    "O=CN(C)C": 434,
    "[K+].[K+].O=S([O-])S(=O)([O-])O": 435,
    "[Na+].[OH-]": 436,
    "N#CCC#N": 437,
    "S1C=2C=CC=CC2SC=3C=CC=CC13": 438,
    "[Cl-].C=1C=CC(=CC1)C[N+](C)(C)C": 439,
    "[Cl-].CCCC[N+](CCCC)(CCCC)CCCC": 440,
    "ClCCl": 441,
    "[Li].O=Cl(=O)(=O)O": 442,
    "N=1C=CNC1": 443,
    "[Na+].[Na+].OP([O-])([O-])=O": 444,
    " OS(=O)(=O)C(F)(F)F": 445,
    "[Mg+2].[Br-].[Br-]": 446,
    "O=S(C)C": 447,
    "[Se]([Se]C=1C=CC=CC1)C=2C=CC=CC2": 448,
    "C1=CC=C2C(=C1)C(=O)NC2=O": 449,
    "[F-][B+3]([F-])([F-])[F-].CC[N+](CC)(CC)CC": 450,
    "[K+].[O-]P(=O)([O-])([O-])[K+].[K+]": 451,
    "[K].O=S(=O)([O-])[O-].O=S(=O)([O-])O.O=S(=O)([O-])OO": 452,
    "C1=CC(=CC=C1C#N)C(=O)O": 453,
    "[Li]Cl": 454,
    "O=C(OC)C1=CC=C(C=C1)C(C)(C)C": 455,
    "Cl[C@H]1[C@@H](Cl)[C@H](Cl)[C@@H](Cl)[C@@H](Cl)[C@@H]1Cl": 456,
    "COC(=O)CC#N": 457,
    "[C-]#N.[C-]#N.[C-]#N.[C-]#N.[C-]#N.[C-]#N.[K+].[K+].[K+].[Fe+3]": 458,
    "C1CCNCC1": 459
  },
  "catalyst": {
    "[Fe++].[cH-]1cccc1.[cH-]2cccc2": 1,
    "[CH]=12[CH]3=[CH]4[CH-]5[CH]1[Fe+2]23678945[CH]=%10[CH]9=[CH]8[CH-]7[CH]%106": 2,
    "Cl[Fe](Cl)Cl": 3,
    "[Pt]": 4,
    "CC(=O)[CH-]C(=O)C.CC(=O)[CH-]C(=O)C.[Cu+2]": 5,
    "[Br-][Ni+2]1([Br-])O(C)CCO1C": 6,
    "CC(C)(C)C1=CC(=NC=C1)C2=NC=CC(=C2)C(C)(C)C": 7,
    "CC(=O)[O-].CC(=O)[O-].[Co+2]": 8,
    "C(F)(F)(F)S(=O)(=O)O.[Sc]": 9,
    "C(F)(F)(F)S(=O)(=O)O.C(F)(F)(F)S(=O)(=O)O.[Mn]": 10,
    "[Cu+2].[O-]S(=O)(=O)C(F)(F)F.[O-]S(=O)(=O)C(F)(F)F": 11,
    "Cl[Mn]Cl": 12,
    "CC1=NC2=C(C=C1)C=CC3=C2N=C(C=C3)C": 13,
    "CC(=O)O": 14,
    "CC(C)(C)OC(=O)[C@@H]1COC(=N1)C2(CC2)C3=N[C@@H](CO3)C(=O)OC(C)(C)C": 15,
    "[B-](F)(F)(F)F.CC1=CC(=C(C(=C1)C)C2=C3C=CC=CC3=[N+](C4=CC=CC=C42)C5=CC=CC=C5)C": 16,
    "C(F)(F)(F)S(=O)(=O)[O-].[Cu+]": 17,
    "[B-](F)(F)(F)F.[B-](F)(F)(F)F.[Ni+2]": 18,
    "[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[Ni+2]": 19,
    "C1=CC(=C(C=C1Br)Br)N(C2=C(C=C(C=C2)Br)Br)C3=C(C=C(C=C3)Br)Br": 20,
    "CC(=O)[CH-]C(=O)C.CC(=O)[CH-]C(=O)C.[Co+2]": 21,
    "C1=C(C(=C(C=N1)Cl)Cl)Cl": 22,
    "OC(C(F)(F)F)C(F)(F)F": 23,
    "Cl[Fe]Cl": 24,
    "CC(=O)[O-].CC(=O)[O-].[Fe+2]": 25,
    "c1ccc(nc1)c2ccccn2": 26,
    "C1CNC2=NCCCN2C1": 27,
    "[Ru]": 28,
    "[Ni](Br)Br": 29,
    "C=1C=C[C-]2=C(C1)C=3C=CC=C[N]3[Ir+3]245([C-]=6C=CC=CC6C=7C=CC=C[N]74)[C-]=8C=CC=CC8C=9C=CC=C[N]95": 30,
    "[Cl-].[Cl-].[Co+2]": 31,
    "[K+].[I-]": 32,
    "CC(=O)[O-].[Na+]": 33,
    "[Mn++].[Br-].[Br-]": 34,
    "O(C1=CC=C2C(SC3=CC(OC)=CC=C3N2C4=CC=C(C=C4)C(C)(C)C)=C1)C": 35,
    "c1cnc2c(c1)ccc3cccnc23": 36,
    "OC1=C(C=CC=C1C(C)(C)C)C2=N[C@@H](CO2)C3=CC=CC=C3": 37,
    "C1=CC=C([C-]=C1)C2=CC=CC=N2.C1=CC=C([C-]=C1)C2=CC=CC=N2.C1=CC=C([C-]=C1)C2=CC=CC=N2.[Ir]": 38,
    "CC(O)=O": 39,
    "[NH4+].[I-]": 40,
    "C(F)(F)(F)S(=O)(=O)O": 41,
    "Ic1ccccc1": 42,
    "C1=CC(=NC(=C1)N2C=CC=N2)N3C=CC=N3.[Ni](Br)Br": 43,
    "C1=CC(=NC(=C1)N2C=CC=N2)N3C=CC=N3": 44,
    "c1ccc2c(c1)ccc3ccccc23": 45,
    "N=1C=CC(=CC1C=2N=CC=C(C2)C(C)(C)C)C(C)(C)C": 46,
    "Br[Mn]Br": 47,
    "C[N+](C)(C)C.[I-]": 48,
    "C[Si](C)(C)OC([C@@H]1CCCN1)(C2=CC=CC=C2)C3=CC=CC=C3": 49,
    "[C@@H](CC)(C)[C@@]1(N=C(N(C1)C2=CC(C(C)(C)C)=CC=C2)C=3N(C[C@]([C@H](CC)C)(N3)[H])C4=CC(C(C)(C)C)=CC=C4)[H]": 50,
    "CC[C@H](C)[C@H]1CN(C(=N1)C2=N[C@H](CN2C3=CC=CC(=C3)C(C)(C)C)[C@@H](C)CC)C4=CC=CC(=C4)C(C)(C)C": 51,
    "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O-][W](=O)(=O)[O-].[O-][W](=O)(=O)[O-]": 52,
    "[Co].O=C(O)C": 53,
    "[B-](F)(F)(F)F.CCCC[N+](CCCC)(CCCC)CCCC": 54,
    "[Li+].[I-]": 55,
    "CC[N+](CC)(CC)CC.[I-]": 56,
    "[Mn+2].[O-]S(=O)(=O)C(F)(F)F.[O-]S(=O)(=O)C(F)(F)F": 57,
    "O1=C([CH-]C(=O[Cu+2]12O=C([CH-]C(=O2)C)C)C)C": 58,
    "C1=CC=NC(=C1)C2=CC=CC=N2": 59,
    "N1=C2NCCCN2CCC1": 60,
    "[Y].O=C(O)C(F)(F)F": 61,
    "[C@@H](CC)(C)[C@@]1(N=C(N(C1)C2=CC(C(C)(C)C)=CC(C(C)(C)C)=C2)C=3N(C[C@]([C@H](CC)C)(N3)[H])C4=CC(C(C)(C)C)=CC(C(C)(C)C)=C4)[H]": 62,
    "[Mn].O=S(=O)(O)C(F)(F)F": 63,
    "CC(C)(C)C1=CC(=NC=C1)C2=NC=CC(=C2)C(C)(C)C.[Ni](Br)Br": 64,
    "C(F)(F)(F)S(=O)(=O)[O-].C(F)(F)(F)S(=O)(=O)[O-].[Zn+2]": 65,
    "[Mn+2].[Cl-].[Cl-]": 66,
    "[Ni+2].[Cl-].[Cl-]": 67,
    "BrC1=CC=C(C(Br)=C1)N(C2=CC=C(Br)C=C2Br)C3=CC=C(Br)C=C3Br": 68,
    "[Sc].O=S(=O)(O)C(F)(F)F": 69,
    "C(F)(F)(F)S(=O)(=O)[O-].C(F)(F)(F)S(=O)(=O)[O-].C(F)(F)(F)S(=O)(=O)[O-].[Y+3]": 70,
    "C(F)(F)(F)S(=O)(=O)O.[Cu]": 71,
    "S=[P](Oc1ccccc1)(Oc2ccccc2)Oc3ccccc3": 72,
    "[Cu+2].CC(=O)[CH-]C(=O)C.CC(=O)[CH-]C(=O)C": 73,
    "N(C([C@@H](OC1=C(I)C(O[C@H](C(NC2=C(C(C)C)C=CC=C2C(C)C)=O)C)=CC(C)=C1)C)=O)C3=C(C(C)C)C=CC=C3C(C)C": 74,
    "C": 75,
    "c1ccncc1": 76,
    "CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 77,
    "C1=CC=C2C(=C1)C3=CC=CC=C3N2C4=C(C(=C(C(=C4C#N)C#N)N5C6=CC=CC=C6C7=CC=CC=C75)N8C9=CC=CC=C9C1=CC=CC=C18)N1C2=CC=CC=C2C2=CC=CC=C21": 78,
    "CC(C)OC(=O)[C@@H]1COC(=N1)C2(CC2)C3=N[C@@H](CO3)C(=O)OC(C)C": 79,
    "[Cl-][Mn+3]123[N]=4C=5C=CC4C(=C6C=CC(=C(C=7C=CC(=C(C8=CC=C(C5C9=C(C=C(C=C9C)C)C)[N-]81)C%10=C(C=C(C=C%10C)C)C)[N]72)C%11=C(C=C(C=C%11C)C)C)[N-]63)C%12=C(C=C(C=C%12C)C)C": 80,
    "[Fe+2].C1=C[CH-]C=C1.C1=C[CH-]C=C1": 81,
    "O=[W+4]1234[O-2][W+4]567(=O)[O-2][W+4]89(=O)([O-2]1)[O-2][W+4]%10%11(=O)([O-2]2)[O-2][W+4](=O)([O-2]3)([O-2]5)([O-2][W+4]%12%13%14(=O)[O-2][W+4]%15%16(=O)([O-2]6)[O-2][W+4]%17%18(=O)([O-2]8)[O-2][W+4]%19(=O)([O-2]%10)([O-2]%12)[O-2][W+4](=O)([O-2]%15)([O-2]%17)([O-2]%13)[O-2]%16%18%14%19)[O-2]479%11.CCCC[N+](CCCC)(CCCC)CCCC": 82,
    "N=1C=CC(=CC1)N(C)C": 83,
    "O1=C([CH-]C(=O[Co+2]12O=C([CH-]C(=O2)C)C)C)C": 84,
    "CC[C@H](C)[C@H]1CN(C(=N1)C2=N[C@H](CN2C3=CC(=CC(=C3)C(C)(C)C)C(C)(C)C)[C@@H](C)CC)C4=CC(=CC(=C4)C(C)(C)C)C(C)(C)C": 85,
    "[Fe].O=C(O)C": 86,
    "Cl[Cu]": 87,
    "[Ni+2].[F-][B+3]([F-])([F-])[F-]": 88,
    "I[NH4]": 89,
    "c1cc(ccn1)c2ccncc2": 90,
    "CC(C)[C@H]1COC(=N1)C2=NC(=CC=C2)C3=N[C@H](CO3)C(C)C": 91,
    "S=P(OC=1C=CC=CC1)(OC=2C=CC=CC2)OC=3C=CC=CC3": 92,
    "N#CC=1C(C#N)=C(C(=C(C1N2C=3C=CC=CC3C=4C=CC=CC42)N5C=6C=CC=CC6C=7C=CC=CC75)N8C=9C=CC=CC9C=%10C=CC=CC%108)N%11C=%12C=CC=CC%12C=%13C=CC=CC%13%11": 93,
    "[Fe+2].CC(=O)[O-].CC(=O)[O-]": 94,
    "[Br-][Ni+2]12([Br-])[N]3=CC=CN3C4=CC=CC(N5C=CC=[N]51)=[N]42": 95,
    "BrCCBr": 96,
    "[Na+].[Br-]": 97,
    "C(OC(C)(C)C)(=O)[C@H]1N=C(C2(CC2)C3=N[C@H](C(OC(C)(C)C)=O)CO3)OC1": 98,
    "O=S(=O)(O)C(F)(F)F": 99,
    "C(C)(C)[C@@H]1N=C(OC1)C=2N=C(C=CC2)C3=N[C@@H]([C@H](C)C)CO3": 100,
    "N=1C=CC=C2C=CC=3C=CC=NC3C12": 101,
    "[F-][P+5]([F-])([F-])([F-])([F-])[F-].C(#[N][Rh+3]12([N]#CC)([C-]=3C=CC=CC3C=4SC5=CC=C(C=C5[N]41)C(C)(C)C)[C-]=6C=CC=CC6C=7SC8=CC=C(C=C8[N]72)C(C)(C)C)C": 102,
    "[O-]1C=2C=CC(=CC2C=[N]3C(C)(C)C([N]4=CC=5C=C(C=CC5[O-][Co+2]134)C(C)(C)C)(C)C)C(C)(C)C": 103,
    "CC(=O)[O-].CC(=O)[O-].[Cu+2]": 104,
    "C1=CC=C(C(=C1)C=NCCN=CC2=CC=CC=C2O)O.[Co]": 105,
    "[F-][B+3]([F-])([F-])[F-].C=1C=CC(=CC1)[N+]=2C=3C=CC=CC3C(=C4C=CC=CC42)C=5C(=CC(=CC5C)C)C": 106,
    "O.O.O.O.[Mn++].CC([O-])=O.CC([O-])=O": 107,
    "N=1C(=CC=C2C=CC=3C=CC(=NC3C12)C)C": 108,
    "[Ni].O=N(=O)O": 109,
    "C(#N)C1=C(C(=O)C(=C(C1=O)Cl)Cl)C#N": 110,
    "[Cu].O=S(=O)(O)C(F)(F)F": 111,
    "C1=CC(=CC=C1N(C2=CC=C(C=C2)Br)C3=CC=C(C=C3)Br)Br": 112,
    "ClC1=CN=CC(Cl)=C1Cl": 113,
    "[Br-][Ni+2]1([Br-])[N]2=CC=C(C=C2C=3C=C(C=C[N]31)C(C)(C)C)C(C)(C)C": 114,
    "COC1=CC2=C(C=C1)N(C3=C(S2)C=C(C=C3)OC)C4=CC=C(C=C4)SC": 115,
    "N=1C=CC=CC1": 116,
    "C(=C(/C)\\O)\\C1=N[C@@H]([C@@H](C)C)CO1": 117,
    "C[C-]1C(=C(C(=C1C)C)C)C.C[C-]1C(=C(C(=C1C)C)C)C.Cl[Rh+]Cl.Cl[Rh+]Cl": 118,
    "F[P-](F)(F)(F)(F)F.[Na+]": 119,
    "C1=CC=C(C=C1)OP(=S)(OC2=CC=CC=C2)OC3=CC=CC=C3": 120,
    "Cl[Co]Cl": 121,
    "[Cu+].CC([O-])=O": 122,
    "O=[Fe]O[Fe]=O": 123,
    "C4(=CC=C(C(C)(C)C)C=C4)N1C2=C(C=C(OC)C=C2)SC2=C1C=CC(OC)=C2": 124,
    "CC[N+](CC)(CC)CC.[Cl-]": 125,
    "CN(C)c1cc[nH+]cc1": 126,
    "N1=CC=CN1C=2N=C(C=CC2)N3N=CC=C3": 127,
    "Br[Mn]Br.O": 128,
    "N1=C(C2=NC(CN2C=3C=C(C=C(C3)C(C)(C)C)C(C)(C)C)C(C)CC)N(C=4C=C(C=C(C4)C(C)(C)C)C(C)(C)C)CC1C(C)CC": 129,
    "[Y].O=S(=O)(O)C(F)(F)F": 130,
    "C1=CC=C2C(=C1)C3=NC4=NC(=NC5=C6C=CC=CC6=C([N-]5)N=C7C8=CC=CC=C8C(=N7)N=C2[N-]3)C9=CC=CC=C94.[Fe+2]": 131,
    "[K]I": 132,
    "CC(C)C1=CC(=C(C(=C1)C(C)C)C2=C3C(=C4CCCCC4=C2)C5=C6CCCCC6=CC(=C5OP(=O)(O3)O)C7=C(C=C(C=C7C(C)C)C(C)C)C(C)C)C(C)C": 133,
    "C1=CC=C(C=C1)N(C2=CC=CC=C2)C3=C(C(=C(C(=C3C#N)N(C4=CC=CC=C4)C5=CC=CC=C5)N(C6=CC=CC=C6)C7=CC=CC=C7)N(C8=CC=CC=C8)C9=CC=CC=C9)C#N": 134,
    "[Cu+].[O-]C(=O)C": 135,
    "[I-].CCCC[N+](CCCC)(CCCC)CCCC": 136,
    "COCCOC.Cl[Ni]Cl": 137,
    "[Sc+3].[O-]S(=O)(=O)C(F)(F)F.[O-]S(=O)(=O)C(F)(F)F.[O-]S(=O)(=O)C(F)(F)F": 138,
    "[Cu+].[Cl-]": 139,
    "C1=CC=C(C=C1)P(C2=CC=CC=C2)C3=CC=CC=C3.Cl[Au]": 140,
    "CC(=O)[O-].CC(=O)[O-].[Ni+2]": 141,
    "Cl[Cu]Cl": 142,
    "C1=CC=NC(=C1)C2=CC=CC=N2.[Ni](Br)Br": 143,
    "N=1C=2C=3C=CC=CC3C4=NC5=C6C=CC=CC6=C7N=C8C=9C=CC=CC9C=%10N=C%11C=%12C=CC=CC%12C1[N-]%11[Fe+2]([N]24)([N]%108)[N-]57": 144,
    "C=1C=CC2=C(C1)C=CC=3C=CC=CC32": 145,
    "[Cu].O=C(O)C": 146,
    "[Li+].O.O.O.[O-][Cl](=O)(=O)=O": 147,
    "C1=CC=C2C(=C1)C=CC3=C2C4=C(C=CC5=CC=CC=C54)OP(=O)(O3)O": 148,
    "O(C1=CC=C2C(SC3=CC(OC)=CC=C3N2C4=CC=C(SC)C=C4)=C1)C": 149,
    "CC(C)(C)C1=CC(C(C)(C)C)=C2O[Co]34<-N(=CC2=C1)C(C)(C)C(C)(C)N->3=CC1=C(O4)C(C(C)(C)C)=CC(C(C)(C)C)=C1": 150,
    "C1=CC=C(C=C1)I": 151,
    "[Na].O=C(O)C": 152,
    "OC1=C(C=C(C(C)(C)C)C=C1C(C)(C)C)C2=N[C@H](C(C)(C)O2)C3=CC=CC=C3": 153,
    "[Cl-].[Cl-].[Mn+2]": 154,
    "CCC(C)[C@H]1COC(=N1)C2=N[C@H](CO2)C(C)CC": 155,
    "C(C)(=O)[O-].[Fe+2].C(C)(=O)[O-]": 156,
    "[Mn].O=C(O)C.O": 157,
    "[Ag]": 158,
    "[Cl-].[Ag+]": 159,
    "C1=CC=C2C(=C1)C3=CC=CC=C3N2C4=C(C(=C(C(=C4C#N)N5C6=CC=CC=C6C7=CC=CC=C75)N8C9=CC=CC=C9C1=CC=CC=C18)N1C2=CC=CC=C2C2=CC=CC=C21)C#N": 160,
    "[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].[N+](=O)([O-])[O-].O.O.O.O.O.O.O.O.O.[Fe+3]": 161,
    "CCCC[N+](CCCC)(CCCC)CCCC.[Br-]": 162,
    "O.O.O.O.O.O.[Cl-].[Cl-].[Ni++]": 163,
    "C1=C[CH]C=C1.C1=C[CH]C=C1.[Fe]": 164,
    "[Ni]": 165,
    "CN1C=NC=C1C2=C(C=NC=C2NC(=O)C3=C4N=CC(=CN4N=C3N)F)F": 166,
    "O=Cl(=O)(=O)[O-].C(#[N][Cu+2]123[N]=4C5=CC=CC4C[N]3(C)CC[N]2(C)CC[N]1(C)C5)C": 167,
    "[F-][B+3]([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 168,
    "[Na]Br": 169,
    "C1=CC=C2C(=C1)C=CC3=CC=CC=C32": 170,
    "C1=CC=C(C(=C1)C2=C3C=C(C(=O)C(=C3OC4=C(C(=C(C=C24)Br)[O-])Br)Br)Br)C(=O)[O-].[Na+].[Na+]": 171,
    "COCCOC.Br[Ni]Br": 172,
