{
 "solvent": {
  "__ABSENT__": 0,
  "__OTHER__": 1,
  "CC#N": 2,
  "ClCCl": 3,
  "CN(C)C=O": 4,
  "CO": 5,
  "CC(C)=O": 6,
  "CS(C)=O": 7,
  "OC(C(F)(F)F)C(F)(F)F": 8,
  "ClCCCl": 9,
  "C1CCOC1": 10,
  "OCC(F)(F)F": 11,
  "CC(=O)N(C)C": 12,
  "CC(=O)O": 13,
  "CCO": 14,
  "C[N+](=O)[O-]": 15,
  "C1COCCO1": 16,
  "O": 17,
  "COCCOC": 18,
  "COC(C)(C)C": 19,
  "CN1CCCC1=O": 20,
  "FC(F)(F)c1ccccc1": 21,
  "CCOC(C)=O": 22,
  "CCOCC": 23,
  "CCC(C)(C)O": 24,
  "CC(C)(C)O": 25,
  "ClC(Cl)Cl": 26,
  "CC(C)C#N": 27,
  "CCCCO": 28,
  "CCCO": 29,
  "CC#N.O": 30,
  "Cc1ccccc1": 31,
  "O=CO": 32,
  "CC(=O)OC(C)=O": 33,
  "CN1CCN(C)C1=O": 34,
  "CC(C)O": 35,
  "CCC(C)O": 36,
  "[2H]C([2H])(Cl)Cl": 37,
  "C1CCCCC1": 38,
  "CCN(CC)CC.F.F.F": 39,
  "CCN(CC)CC.F.F.F.F.F": 40,
  "N#Cc1ccccc1": 41,
  "OCCO": 42,
  "CC(=O)CC(C)C": 43,
  "CC(=O)OCC(COC(C)=O)OC(C)=O": 44,
  "CC(Cl)Cl.OCC(F)(F)F": 45,
  "CC1CCCO1": 46,
  "CCC(=O)O": 47,
  "CCC(C)=O": 48,
  "CCCCn1cc[n+](C)c1.F[P-](F)(F)(F)(F)F": 49,
  "CCOC(=O)OCC": 50,
  "CN1CCCN(C)C1=O": 51,
  "COC(=O)OC": 52,
  "Cc1cc(C)nc(C)c1": 53,
  "N#CCCl": 54,
  "O=C1CCCC1": 55,
  "OC(O)C(F)(F)F": 56,
  "[2H]C([2H])([2H])C#N": 57,
  "c1ccncc1": 58,
  "BrCBr": 59,
  "CCC(C)(C)O.O": 60,
  "CCCC#N": 61,
  "CCCCC": 62,
  "CCCCCO": 63,
  "CCC[N+](=O)[O-]": 64,
  "CN(C)C=O.CS(C)=O": 65,
  "CO.O": 66,
  "COC(C)(C)C.CS(C)=O.OC(C(F)(F)F)C(F)(F)F": 67,
  "C[N](=O)[O]": 68,
  "Cc1cc(C)cc(C)c1": 69,
  "Cc1ccc(C)cc1": 70,
  "ClC(Cl)(Cl)Cl": 71,
  "ClCCBr": 72,
  "Clc1ccccc1": 73,
  "Clc1ccccc1Cl": 74,
  "N#CCc1ccccc1": 75,
  "O=C(O)C(F)(F)F": 76,
  "O=[N+]([O-])c1ccccc1": 77,
  "[H+].[OH-]": 78
 },
 "electrolyte": {
  "__ABSENT__": 0,
  "__OTHER__": 1,
  "CCCC[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 2,
  "[Li+].[O-][Cl+3]([O-])([O-])[O-]": 3,
  "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 4,
  "CCCC[N+](CCCC)(CCCC)CCCC.[O-][Cl+3]([O-])([O-])[O-]": 5,
  "CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 6,
  "CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 7,
  "CC[N+](CC)(CC)CC.F[B-](F)(F)F": 8,
  "CCCC[N+](CCCC)(CCCC)CCCC.[Br-]": 9,
  "F[P-](F)(F)(F)(F)F.[K+]": 10,
  "CC[N+](CC)(CC)CC.[Cl-]": 11,
  "CC[N+](CC)(CC)CC.F[P-](F)(F)(F)(F)F": 12,
  "CC[N+](CC)(CC)CC.[O-][Cl+3]([O-])([O-])[O-]": 13,
  "[I-].[Na+]": 14,
  "CC[N+](CC)(CC)CC.[I-]": 15,
  "[Br-].[K+]": 16,
  "[Li].[O-][Cl+3]([O-])([O-])O": 17,
  "[Br-].[Na+]": 18,
  "CCCC[N+](CCCC)(CCCC)CCCC.[Cl-]": 19,
  "[I-].[K+]": 20,
  "[Br-].[Li+]": 21,
  "CCCC[N+](CCCC)(CCCC)CCCC.O=S(=O)([O-])O": 22,
  "F[B-](F)(F)F.[Li+]": 23,
  "O=S(=O)([O-])C(F)(F)F.[Li+]": 24,
  "CC[N+](CC)(CC)CC.[Br-]": 25,
  "CC[N+](CC)(CC)CC.Cc1ccc(S(=O)(=O)[O-])cc1": 26,
  "[Cl-].[Li+]": 27,
  "O.O.O.[Li+].[O-][Cl+3]([O-])([O-])[O-]": 28,
  "C[N+](C)(C)Cc1ccccc1.[Cl-]": 29,
  "[I-].[Li+]": 30,
  "CCCC[N+](CCCC)(CCCC)CCCC.[F-]": 31,
  "C[N+](C)(C)C.F[B-](F)(F)F": 32,
  "O=C([O-])O.[K+]": 33,
  "[I-].[NH4+]": 34,
  "CC(C)(C)C(=O)[O-].[Na+]": 35,
  "[Cl-].[Na+]": 36,
  "CCCC[N+](CCCC)(CCCC)CCCC.O=S(=O)([O-])C(F)(F)F": 37,
  "CCCCn1cc[n+](C)c1.F[P-](F)(F)(F)(F)F": 38,
  "CCN(CC)CC.F.F.F": 39,
  "C=Cn1cc[n+](CCCC)c1.[Br-]": 40,
  "CCN(CC)CC.F": 41,
  "CCCC[n+]1ccccc1.F[P-](F)(F)(F)(F)F": 42,
  "[Li][Cl]": 43,
  "CCCC[P+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 44,
  "Br.C=C[n+]1ccn(CCC)c1": 45,
  "C=C[n+]1ccn(CCCC)c1.[Br-]": 46,
  "Cc1ccc(S(=O)(=O)O)cc1": 47,
  "O=S(=O)(O)C(F)(F)F.[Li]": 48,
  "O=S([O-])S(=O)(=O)[O-].[Na+].[Na+]": 49,
  "C[O-].[Na+]": 50,
  "N.N#CS": 51,
  "O=S(O)C(F)(F)F.[Na]": 52,
  "Br": 53,
  "CCCC[N+](CCCC)(CCCC)CCCC.[OH-]": 54,
  "O=C(O)C(F)(F)F": 55,
  "C[N+](C)(C)C.[I-]": 56,
  "N#C[S-].[NH4+]": 57,
  "CCCC[N+](CCCC)(CCCC)CCCC.O=S(=O)([O-])[O-]": 58,
  "CCCC[N+](CCCC)(CCCC)CCCC.Fc1c(F)c(F)c([B-](c2c(F)c(F)c(F)c(F)c2F)(c2c(F)c(F)c(F)c(F)c2F)c2c(F)c(F)c(F)c(F)c2F)c(F)c1F": 59,
  "[Br-].[H+]": 60,
  "[Na][I]": 61,
  "O=P([O-])([O-])O.[NH4+].[NH4+]": 62,
  "O=S([O-])C(F)(F)F.[Na+]": 63,
  "[K+].[OH-]": 64,
  "[N-]=[N+]=[N-].[Na+]": 65,
  "C[N+](C)(C)Cc1ccccc1.[OH-]": 66,
  "F.c1ccncc1": 67,
  "O=S(=O)([O-])C(F)(F)F.[Na+]": 68,
  "F[P-](F)(F)(F)(F)F.[NH4+]": 69,
  "CC(=O)O.CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 70,
  "CC[N+](CC)(CC)CC.F.F.F.[F-]": 71,
  "FC(F)(F)c1cc([B-](c2cc(C(F)(F)F)cc(C(F)(F)F)c2)(c2cc(C(F)(F)F)cc(C(F)(F)F)c2)c2cc(C(F)(F)F)cc(C(F)(F)F)c2)cc(C(F)(F)F)c1.[Na+]": 72,
  "O=C([O-])O.[Na+]": 73,
  "CCN(CC)CC.F.F.F.F.F": 74,
  "O=C(O)O.[K]": 75,
  "O=C([O-])[O-].[Na+].[Na+]": 76,
  "[K][Br]": 77,
  "[Li][Br]": 78,
  "CC(C)(C)C(=O)O.[Na]": 79,
  "CC[NH+](CC)CC.[Cl-]": 80,
  "N#CS.[K]": 81,
  "[Cl-].[Cl-].[Mg+2]": 82,
  "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.O=S(=O)([O-])[O-]": 83,
  "F[B-](F)(F)F.[Na+]": 84,
  "O=C([O-])[O-].[K+].[K+]": 85,
  "O=S(=O)(O)C(F)(F)F": 86,
  "CC[N+](CC)(CC)CC.F.[F-]": 87,
  "F[P-](F)(F)(F)(F)F.[Li+]": 88,
  "[Br-].[Br-].[Mg+2]": 89,
  "[K][I]": 90,
  "Br.c1ccncc1": 91,
  "CC(=O)O": 92,
  "CS(=O)(=O)O": 93,
  "F[P-](F)(F)(F)(F)F.[Na+]": 94,
  "O=S([O-])([O-])=S.[Na+].[Na+]": 95,
  "[Ca+2].[Cl-].[Cl-]": 96,
  "[Cs+].[F-]": 97,
  "[K+].[O-][Cl+3]([O-])([O-])[O-]": 98,
  "CC(C)(C)C(=O)[O-].[K+]": 99,
  "C[N+](C)(C)C.[Br-]": 100,
  "N#C[S-].[K+]": 101,
  "O=S(=O)(O)O": 102,
  "O=S(O)C(F)F.[Na]": 103,
  "[Br-].[NH4+]": 104,
  "[Li][I]": 105,
  "[N-]=[N+]=[N][Na]": 106,
  "[Na+].[O-][Cl+3]([O-])([O-])[O-]": 107,
  "[OH][K]": 108,
  "CC#N": 109,
  "CC(=O)[O-].[NH4+]": 110,
  "CC[N+](CC)(CC)CC.[F-]": 111,
  "Cl": 112,
  "F": 113,
  "F.N": 114,
  "O.O.O.O.[K+].[K+].[O-]B1OB2OB([O-])OB(O1)O2": 115,
  "O=C([O-])[O-].[Ca+2]": 116,
  "O=C[O-].[Li+]": 117,
  "O=S(=O)([N-]S(=O)(=O)C(F)(F)F)C(F)(F)F.[Li+]": 118,
  "[Cl-].[NH4+]": 119,
  "CCCC[N+](C)(CCCC)CCCC.COS(=O)(=O)[O-]": 120,
  "CCC[N+](CCC)(CCC)CCC.[Br-]": 121,
  "CCn1cc[n+](C)c1.F[P-](F)(F)(F)(F)F": 122,
  "C[N+](C)(C)C.[Cl-]": 123,
  "N.O=P(O)(O)O": 124,
  "O=S(=O)(NS(=O)(=O)C(F)(F)F)C(F)(F)F.[Li]": 125,
  "O=S(=O)(O)S.[Na]": 126,
  "O=S(O)S(=O)(=O)O.[Na]": 127,
  "O=[N+]([O-])O.[Fe]": 128,
  "O=[N+]([O-])[O-].[Ag+]": 129,
  "[Na][Br]": 130,
  "CC(=O)[O-].[K+]": 131,
  "CC(=O)[O-].[Na+]": 132,
  "CC(C)(C)C(=O)O.[K]": 133,
  "CC[N+](CC)(CC)CC.O=C([O-])C(F)(F)F": 134,
  "CC[N+](CC)(CC)CC.[OH-]": 135,
  "C[N+](C)(C)C.F[P-](F)(F)(F)(F)F": 136,
  "C[N+](C)(C)C.[F-]": 137,
  "C[N+](C)(C)Cc1ccccc1.[Br-]": 138,
  "Cc1ccc(I)cc1": 139,
  "Cc1ccc(S(=O)(=O)O)cc1.[Na]": 140,
  "F[B-](F)(F)F.[NH4+]": 141,
  "O=P([O-])([O-])[O-].[K+].[K+].[K+]": 142,
  "O=S(=O)(F)Cl": 143,
  "O=S([O-])C(F)(F)F.[Li+]": 144,
  "[F-].[K+]": 145,
  "C=Cn1cc[n+](C)c1.[Br-]": 146,
  "CC(=O)O.N": 147,
  "CCCCCCCCCCCCCCCC[N+](C)(C)C.[Br-]": 148,
  "CCCCC[N+](CCCC)(CCCC)CCCC.[I-]": 149,
  "CCCC[N+](CCCC)(CCCC)CCCC.Cc1ccc(S(=O)(=O)[O-])cc1": 150,
  "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)F": 151,
  "CCCC[N+](CCCC)(CCCC)CCCC.[Br-].[Br-].[Br-]": 152,
  "CC[N+](CC)(CC)CC.F[P-](F)(F)(F)F": 153,
  "CC[N+](CC)(CC)CC.O=S(=O)([O-])C(F)(F)F": 154,
  "CCn1cc[n+](C)c1.F[B-](F)(F)F": 155,
  "CN(C)C=O": 156,
  "C[N+](C)(C)Cc1ccccc1.O=S(=O)([O-])C(F)(F)F": 157,
  "Cc1ccc(S(=O)O)cc1.[Na]": 158,
  "Cc1ccc(S(=O)[O-])cc1.[Na+]": 159,
  "F[B-](F)(F)F.[K+]": 160,
  "O.[Br-].[Br-].[Ca+2]": 161,
  "O=C(O)O.[Na]": 162,
  "O=S(=O)(O)C(F)(F)F.[Mn]": 163,
  "O=S(=O)([O-])[O-].[Na+].[Na+]": 164,
  "O=S([O-])C(F)F.[Na+]": 165,
  "O=S([O-])OS(=O)(=O)[O-].[Na+].[Na+]": 166,
  "O=[N+]([O-])[O-].O=[N+]([O-])[O-].O=[N+]([O-])[O-].[Fe+3]": 167,
  "OCC(F)(F)F": 168,
  "[Br][Mg][Br]": 169,
  "[Cl-].[H+]": 170,
  "[Cl-].[K+]": 171,
  "[F][Sb-]([F])([F])([F])([F])[F].[Na+]": 172,
  "[Li+]<-[O-][Cl+3]([O-])([O-])[O-]": 173,
  "[Na][Cl]": 174,
  "C1=CC=[N+]C=C1.[Br-]": 175,
  "C1=C[NH+]C=C1.[Br-]": 176,
  "C1CCOC1.Cc1ccc(S(=O)(=O)O)cc1.ClCCl.O": 177,
  "C1COCCO1": 178,
  "C=C1N(C)C=CN1C": 179,
  "C=CCN(CC=C)C(=O)CC(=O)O.[K]": 180,
  "C=C[n+]1ccn(CCC)c1": 181,
  "CC(=O)O.[K]": 182,
  "CC(=O)[N-](CCCC)(CCCC)CCCC": 183,
  "CC(=O)[O-].CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 184,
  "CC(=O)[O-].C[N+](C)(C)C": 185,
  "CC(=O)[O-].O.O.O.O.[Na+]": 186,
  "CC(=O)[O-].[Cs+]": 187,
  "CC(=O)[O-].[Li+]": 188,
  "CC(C)(C)C(=O)[O-].O.[Na+]": 189,
  "CC(C)(C)CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 190,
  "CC(C)(C)c1ccc(S(=O)(=O)O)cc1.[Na]": 191,
  "CC(C)CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 192,
  "CC(Cl)Cl": 193,
  "CC(F)(F)S(=O)O.[Na]": 194,
  "CC1CCC(S(=O)O)CC1.[Na]": 195,
  "CCC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 196,
  "CCC(=O)[O-].[NH4+]": 197,
  "CCCCC(=O)O": 198,
  "CCCCCC[B-](F)(F)F.[K+]": 199,
  "CCCCCCn1cc[n+](C)c1C.[Br-]": 200,
  "CCCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)(F)(F)F": 201,
  "CCCCN(CCCC)S(=O)(=O)[O-]": 202,
  "CCCC[N+](CC)(CCCC)CCCC.F[B-](F)(F)F": 203,
  "CCCC[N+](CCCC)(CCCC)CCCC.CC[N+](CC)(CC)CC.F[B-](F)(F)F.F[P-](F)(F)(F)(F)F": 204,
  "CCCC[N+](CCCC)(CCCC)CCCC.F[P-](F)(F)F": 205,
  "CCCC[N+](CCCC)(CCCC)CCCC.O=N[O-]": 206,
  "CCCC[N+](CCCC)(CCCC)CCCC.O=S(=O)(NS(=O)(=O)C(F)(F)F)C(F)(F)F": 207,
  "CCCC[N+](CCCC)(CCCC)CCCC.[2H]C([2H])([2H])C(=O)[O-]": 208,
  "CCCC[N+](CCCC)(CCCC)CCCC.[B-]": 209,
  "CCCC[N+](CCCC)(CCCC)CCCC.[IH-]": 210,
  "CCCC[N+](CCCC)(CCCC)CCCC.[N-]=[N+]=[N-]": 211,
  "CCCC[N+](CCCC)CCCC.[O-][Cl+3]([O-])([O-])[O-]": 212,
  "CCCC[P+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 213,
  "CCCC[P+](CCCC)(CCCC)CCCC.[Br-]": 214,
  "CCN(CC)CC.[Cl-].[H+]": 215,
  "CCOC(=O)C(=O)O.[K]": 216,
  "CC[N+](C)(CC)CC.F[B-](F)(F)F": 217,
  "CC[N+](C)(CC)CC.[F-]": 218,
  "CC[N+](CC)(CC)CC.F.F.F": 219,
  "CC[N+](CC)(CC)CC.F.F.F.F.[F-]": 220,
  "CC[N+](CC)(CC)CC.F.F.[F-]": 221,
  "CC[N+](CC)(CC)CC.F[B-](F)(F)F.[Br-].[Na+]": 222,
  "CC[N+](CC)(CC)CC.[I-].[I-].[NH4+]": 223,
  "CC[N+](CC)CC.F.F.F.[F-]": 224,
  "CC[N+](CC)CC.[F-]": 225,
  "CC[N+]1(C)CCCC1.[Br-]": 226,
  "CC[n+]1ccn(C)c1.[O-][Cl+3]([O-])([O-])[O-]": 227,
  "CCn1cc[n+](C)c1.[O-][Cl+3]([O-])([O-])[O-]": 228,
  "CNNS(=O)(=O)c1ccc(C)cc1": 229,
  "CS(C)=O": 230,
  "C[B-](F)(F)F.[K+]": 231,
  "C[N+](C)Cc1ccccc1.[Cl-]": 232,
  "C[O-].[Li+]": 233,
  "C[Si](C)(C)N=[N+]=[N-]": 234,
  "Cc1ccc(S(=O)(=O)O)cc1.O": 235,
  "Cc1ccc(S(=O)(=O)[O-])cc1.[Na+]": 236,
  "Cc1cccc(S(=O)O)c1.[Na]": 237,
  "ClCCCl": 238,
  "Clc1ccc(Br)cc1": 239,
  "F.F": 240,
  "F.F.F.F.F.F.F": 241,
  "FC(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)C(F)(F)Br": 242,
  "F[As-](F)(F)(F)(F)F.[Li+]": 243,
  "Ic1ccccc1": 244,
  "N#C[Se-].[K+]": 245,
  "N#C[SeH].[K]": 246,
  "NCC(=O)c1ccccc1F": 247,
  "O.O.O.O.O.O.O.O.O.O=[N+]([O-])O.O=[N+]([O-])O.O=[N+]([O-])O.[Fe+3]": 248,
  "O.O.O.O.O.O.[Br-].[Br-].[Mg+2]": 249,
  "O.[K+].[O]=[Os-2](=[O])(=[O])=[O]": 250,
  "O=C(O)CC(F)(F)F": 251,
  "O=C([O-])C(F)(F)F.[Li+]": 252,
  "O=C([O-])O": 253,
  "O=C([O-])[C@@H](O)C(O)[C@@H](O)C(=O)[O-].[K+].[Na+]": 254,
  "O=C([O-])[O-].[NH4+].[NH4+]": 255,
  "O=C1C=CC(=O)C=C1": 256,
  "O=C1CCC(=O)N1Cl": 257,
  "O=P(O)(O)O": 258,
  "O=P(O)(O)O.[Na]": 259,
  "O=P([O-])([O-])OP(=O)([O-])[O-].[K+].[K+].[K+].[K+]": 260,
  "O=S(=O)(F)[N-]S(=O)(=O)F.[Li+]": 261,
  "O=S(=O)(O)C(F)(F)F.O=S(=O)(O)C(F)(F)F.[Mn]": 262,
  "O=S(=O)(O)C(F)(F)F.[Fe]": 263,
  "O=S(=O)(O)C(F)(F)F.[Zn]": 264,
  "O=S(=O)(O)O.[Na]": 265,
  "O=S(=O)(O)c1ccc(-c2ccccc2)cc1.[Na]": 266,
  "O=S(=O)(O)c1cccc(Br)c1.[Na]": 267,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Cu+2]": 268,
  "O=S(=O)([O-])C(F)(F)F.[K+]": 269,
  "O=S(=O)([O-])O.[NH4+]": 270,
  "O=S(O)C(F)(F)F.[K]": 271,
  "O=S(O)C1CC1.[Na]": 272,
  "O=S([O-])C(F)(F)F": 273,
  "O=S([O-])OS(=O)(=O)[O-].[Na+]": 274,
  "O=S([O-])OS(=O)O.[Na+].[Na+]": 275,
  "O=S([O-])OS(=O)[O-].[Na+].[Na+]": 276,
  "O=S([O-])O[SH](=O)=O.[Na+].[Na+]": 277,
  "O=S([O-])c1ccccc1": 278,
  "O=[N+]([O-])[O-].[K+]": 279,
  "O=[N+]([O-])[O-].[NH4+]": 280,
  "O=[N+]([O-])[O-].[Na+]": 281,
  "O=[SH](=O)OS(=O)(=O)[O-].[K+].[K+]": 282,
  "OC(C(F)(F)F)C(F)(F)F": 283,
  "OC(F)C(F)(F)F": 284,
  "OCCN(CCO)CCO": 285,
  "OO": 286,
  "On1nnc2ccccc21": 287,
  "[Ag][I]": 288,
  "[Br-].[Br-].[Ni+2]": 289,
  "[Br-].[Cs+]": 290,
  "[Br-].c1ccncc1": 291,
  "[Ca+2].[F-].[F-]": 292,
  "[Ca+2].[I-].[I-]": 293,
  "[Cl][Mg][Cl]": 294,
  "[Cl][Zn][Cl]": 295,
  "[Cu][I]": 296,
  "[F-].[F-].[Mg+2]": 297,
  "[F][Sb-]([F])([F])([F])([F])[F].[Li+]": 298,
  "[Fe+2].[c-]1cccc1.[c-]1cccc1": 299,
  "[I-].[Li+].[Li+].[O-][Cl+3]([O-])([O-])[O-]": 300,
  "[K+].[N-]=C=S": 301,
  "[K+].[O-][Br+2]([O-])[O-]": 302,
  "[Li+].[O-][Cl+]([O-])(O)O": 303,
  "[Li+].c1ccc([B-](c2ccccc2)(c2ccccc2)c2ccccc2)cc1": 304,
  "[Mg+2].[O-][Cl+3]([O-])([O-])[O-].[O-][Cl+3]([O-])([O-])[O-]": 305,
  "[NH4+].[O-][Cl+3]([O-])([O-])[O-]": 306,
  "[Na+].[O]S(=O)(=O)C(F)(F)F": 307,
  "c1ccc2scnc2c1": 308
 },
 "catalyst": {
  "__ABSENT__": 0,
  "__OTHER__": 1,
  "[Fe+2].c1cc[cH-]c1.c1cc[cH-]c1": 2,
  "N#Cc1c(C#N)c(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c1-n1c2ccccc2c2ccccc21": 3,
  "[cH]12->[Fe+2]3456789(<-[cH]1[cH]->3[cH-]->4[cH]->52)<-[cH]1[cH]->6[cH]->7[cH-]->8[cH]->91": 4,
  "CC(=O)[O-].CC(=O)[O-].O.O.O.O.[Co+2]": 5,
  "[Cl][Fe]([Cl])[Cl]": 6,
  "O.O.O.O.O.O.[Cl-].[Cl-].[Ni+2]": 7,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Mn+2]": 8,
  "[Br-].[Na+]": 9,
  "CC1(C)CCCC(C)(C)N1[O]": 10,
  "[Pt]": 11,
  "Cc1ccc(I)cc1": 12,
  "c1cc[c]([Fe][c]2ccccc2)cc1": 13,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1": 14,
  "Cc1cc(C)c(-c2c3ccccc3[n+](C)c3ccccc23)c(C)c1.[O-][Cl+3]([O-])([O-])[O-]": 15,
  "CCCC[N+](CCCC)(CCCC)CCCC.[I-]": 16,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Cu+2]": 17,
  "CC(=O)[O-].CC(=O)[O-].[Co+2]": 18,
  "CC(=O)[CH-]C(C)=O.CC(=O)[CH-]C(C)=O.[Cu+2]": 19,
  "CC1=Cc2ccccc2N(c2c(C)cc(C)cc2C)c2ccccc21.[O-][Cl+3]([O-])([O-])[O-]": 20,
  "[Cl-].[Cl-].[Fe+2]": 21,
  "COCCOC.[Br][Ni][Br]": 22,
  "O.O.O.O.[Cl][Mn][Cl]": 23,
  "[Cl-].[Cl-].[Co+2]": 24,
  "Brc1ccc(N(c2ccc(Br)cc2Br)c2ccc(Br)cc2Br)c(Br)c1": 25,
  "[Cl][Fe][Cl]": 26,
  "[Cl-].[Cl-].[Ni+2]": 27,
  "COCCOCCOC.[Br-].[Br-].[Ni+2]": 28,
  "[I-].[K+]": 29,
  "[Br-].[Br-].[Ni+2]": 30,
  "[I-].[NH4+]": 31,
  "c1ccc2c(c1)ccc1ccccc12": 32,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].[Co+2]": 33,
  "CC1CCCC(C)N1C1C(N2C(C)CCCC2C)C1N1C(C)CCCC1C": 34,
  "COCCOCCOC.[Br][Ni][Br]": 35,
  "CC(C)(C)c1cc2c(c(C(C)(C)C)c1)[O][Co]13[O]c4c(cc(C(C)(C)C)cc4C(C)(C)C)C=[N+]1C(C)(C)C(C)(C)[N+]3=C2": 36,
  "[Br-].[Br-].[Mn+2]": 37,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].[Cu+2]": 38,
  "Cc1ccc2ccc3ccc(C)nc3c2n1": 39,
  "[Cl][Au].c1ccc(P(c2ccccc2)c2ccccc2)cc1": 40,
  "c1ccc(-c2ccccn2)nc1": 41,
  "C1CN=C2NCCCN2C1": 42,
  "O.O.O.O.[Cl-].[Cl-].[Mn+2]": 43,
  "COCCOC.[Br-].[Br-].[Ni+2]": 44,
  "O=S(=O)([O-])C(F)(F)F.[Cu+]": 45,
  "[I-].[Li+]": 46,
  "O=C1c2ccccc2C(=O)c2ccccc21": 47,
  "[Br-].[Br-].[Ni+2].c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1": 48,
  "[Cl][Mn][Cl]": 49,
  "COc1ccc2c(c1)Sc1cc(OC)ccc1N2C": 50,
  "c1cnc2c(c1)ccc1cccnc12": 51,
  "COCCOC.[Cl][Ni][Cl]": 52,
  "CC(=O)[O-].CC(=O)[O-].[Fe+2]": 53,
  "CC(=O)[O-].CC(=O)[O-].[Pd+2]": 54,
  "N#CC1=C(C#N)C(=O)C(Cl)=C(Cl)C1=O": 55,
  "O=C1c2ccccc2C(=O)N1O": 56,
  "C1COCCO1.[Br][Ni][Br]": 57,
  "CC(=O)[CH-]C(C)=O.CC(=O)[CH-]C(C)=O.[Co+2]": 58,
  "COc1ccc2c(c1)Sc1cc(OC)ccc1N2c1ccc(C(C)(C)C)cc1": 59,
  "CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])([OH])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[OH]": 60,
  "S=P(Oc1ccccc1)(Oc1ccccc1)Oc1ccccc1": 61,
  "O=S(=O)(O)C(F)(F)F": 62,
  "Cc1cc(C)c(C2=C3C=CC(=N3)C(c3c(C)cc(C)cc3C)=C3C=CC(=N3)C(c3c(C)cc(C)cc3C)=C3C=CC(=N3)C(c3c(C)cc(C)cc3C)=C3C=CC2=N3)c(C)c1.[Cl][Mn]": 63,
  "c1cc[c-]2->[Ir+3]34(<-[c-]5ccccc5-c5cccc[n]->35)(<-[c-]3ccccc3-c3cccc[n]->43)<-[n]3ccccc3-c2c1": 64,
  "[C].[Pt]": 65,
  "CC(=O)[O-].[Na+]": 66,
  "Ic1ccccc1": 67,
  "OC(C(F)(F)F)C(F)(F)F": 68,
  "CC[C@H](C)[C@H]1CN(c2cccc(C(C)(C)C)c2)C(C2=N[C@@H]([C@@H](C)CC)CN2c2cccc(C(C)(C)C)c2)=N1": 69,
  "O.O.O.O.O.O.[Cl-].[Cl-].[Cl-].[Fe+3]": 70,
  "O=S(=O)(O)C(F)(F)F.O=S(=O)(O)C(F)(F)F.[Mn]": 71,
  "[Br-].c1cc[nH+]cc1": 72,
  "CC(=O)O": 73,
  "CC#[N+][Rh]12([N+]#CC)([c]3ccccc3-c3sc4ccc(C(C)(C)C)cc4[n+]31)[c]1ccccc1-c1sc3ccc(C(C)(C)C)cc3[n+]12": 74,
  "[Ir].[c-]1ccccc1-c1ccccn1.[c-]1ccccc1-c1ccccn1.[c-]1ccccc1-c1ccccn1": 75,
  "Brc1ccc(N(c2ccc(Br)cc2)c2ccc(Br)cc2)cc1": 76,
  "C[Si](C)(C)OC(c1ccccc1)(c1ccccc1)C1CCCN1": 77,
  "[Br-][Ni+2]1([Br-])O(C)CCO1C": 78,
  "C[N+](C)(C)C.[I-]": 79,
  "Cl[Si](c1ccccc1)(c1ccccc1)c1ccccc1": 80,
  "O=S(=O)(O)C(F)(F)F.[Cu]": 81,
  "[Br][Ni][Br].c1cc(-n2cccn2)nc(-n2cccn2)c1": 82,
  "[Cl][Cu]": 83,
  "Cc1c(C)c(C)[c-](C)c1C.Cc1c(C)c(C)[c-](C)c1C.[Cl-].[Cl-].[Cl-].[Cl-].[Rh+2].[Rh+2]": 84,
  "[Br][Mn][Br]": 85,
  "[Fe+2].[c-]1cccc1.[c-]1cccc1": 86,
  "CC[N+](CC)(CC)CC.[I-]": 87,
  "O=C(O[C@@H]1CCCC[C@H]1OC(=O)c1cccc(-c2cccc(I)c2)c1)c1cccc(-c2cccc(I)c2)c1": 88,
  "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])([O-])[O-].[O]=[W](=[O])([O-])[O-]": 89,
  "N#Cc1c(N(c2ccccc2)c2ccccc2)cc(N(c2ccccc2)c2ccccc2)c(C#N)c1N(c1ccccc1)c1ccccc1": 90,
  "[I-].[Na+]": 91,
  "CC(=O)O.[Co]": 92,
  "CC1[CH-]C(C)=[O]->[Cu+2]2(<-[O]=1)<-[O]=C(C)[CH-]C(C)=[O]->2": 93,
  "[Ca+2].[Cl-].[Cl-]": 94,
  "[Cl-].[Cl-].[Mn+2]": 95,
  "[Ir].c1ccc(-c2ccccn2)cc1": 96,
  "C1=[N+]2C3CCCCC3[N+]3=Cc4ccccc4[O][Co]23[O]c2ccccc21": 97,
  "CC(=O)NC(=O)C1CC2CCC1CN2[O]": 98,
  "[Ir].c1ccc(-c2ccccn2)cc1.c1ccc(-c2ccccn2)cc1.c1ccc(-c2ccccn2)cc1": 99,
  "*N1c2ccc(OC)cc2Sc2cc(OC)ccc21": 100,
  "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])([OH])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[OH]": 101,
  "COc1ccc2c(c1)Sc1cc(OC)ccc1N2c1ccc(SC)cc1": 102,
  "F[B-](F)(F)F.c1ccc(-c2cc(-c3ccccc3)[o+]c(-c3ccccc3)c2)cc1": 103,
  "O=C1C2=C(c3c1c(=O)oc1ccc(O)cc31)C(Br)(Br)C(Br)(Br)C2(Br)Br": 104,
  "[O]=[Ti]=[O]": 105,
  "Brc1cc(Br)cc(N(c2cc(Br)cc(Br)c2)c2cc(Br)cc(Br)c2)c1": 106,
  "CC(=O)[O][Pd][C](C)=O": 107,
  "F[B-](F)(F)F.F[B-](F)(F)F.O.O.O.O.O.O.[Ni+2]": 108,
  "O.O.O.O.[Br-].[Br-].[Mn+2]": 109,
  "O=S(=O)(O)C(F)(F)F.[Mn]": 110,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Y+3]": 111,
  "CC(=O)NC1CC2(CCCCC2)N(O)C2(CCCCC2)C1": 112,
  "CC(=O)[O-].CC(=O)[O-].O.O.O.O.[Mn+2]": 113,
  "COc1ccc(I)cc1": 114,
  "O=C([O-])C(F)(F)F.O=C([O-])C(F)(F)F.O=C([O-])C(F)(F)F.[Y+3]": 115,
  "O[C@H](c1ccc(C(F)(F)F)cc1)[C@@H]1N[C@@H](c2ccc(C(F)(F)F)cc2)[C@H](O)c2ccccc21": 116,
  "[Bi+3].[O-2].[O-2].[O-2].[O-2].[V+5]": 117,
  "[Ce+3].[Cl-].[Cl-].[Cl-]": 118,
  "c1ccncc1": 119,
  "CC(C)[C@H]1COC(c2cccc(C3=N[C@@H](C(C)C)CO3)n2)=N1": 120,
  "CC1(C)O[C@@H](c2ccccc2)[N+]2=Cc3ccc4ccccc4c3[C@@H]2O1.c1ccc([B-](c2ccccc2)(c2ccccc2)c2ccccc2)cc1": 121,
  "c1ccc(N(c2ccccc2)c2ccccc2)cc1": 122,
  "CC(=O)O.[Fe]": 123,
  "CC(=O)[O-].[Cu+]": 124,
  "CC(C)Oc1cc(O[C@@H](C)C(=O)Nc2c(C(C)C)cccc2C(C)C)c(I)c(O[C@@H](C)C(=O)Nc2c(C(C)C)cccc2C(C)C)c1": 125,
  "CC1[CH-]C(C)=[O]->[Co+2]2(<-[O]=1)<-[O]=C(C)[CH-]C(C)=[O]->2": 126,
  "CCCCCCCC[N+](CCCCCCCC)(CCCCCCCC)CCCCCCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])([OH])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[OH]": 127,
  "CCCC[N+](CCCC)(CCCC)CCCC.[Cl-]": 128,
  "Cc1cc(C)c(-[n+]2c3ccccc3c(C)c3ccccc32)c(C)c1.[O-][Cl+3]([O-])([O-])[O-]": 129,
  "Cc1ccc(C(C)C)cc1.[Cl-].[Cl-].[Cl-].[Cl-].[Os+2].[Os+2]": 130,
  "F[B-](F)(F)F.F[B-](F)(F)F.[Ni+2]": 131,
  "O=C(O)c1cc2c(Br)c(O)c(Br)cc2oc2c(=O)c3c(Br)c(O)c(Br)cc3c1=2": 132,
  "O=C1C=CC(=O)N1c1ccccc1": 133,
  "O=[W+4]1234[O-2][W+4]567(=O)[O-2][W+4]89(=O)([O-2]1)[O-2][W+4]%10%11(=O)([O-2]2)[O-2][W+4](=O)([O-2]3)([O-2]5)([O-2][W+4]%12%13%14(=O)[O-2][W+4]%15%16(=O)([O-2]6)[O-2][W+4]%17%18(=O)([O-2]8)[O-2][W+4]%19(=O)([O-2]%10)([O-2]%12)[O-2][W+4](=O)([O-2]%15)([O-2]%17)([O-2]%13)[O-2]%16%18%14%19)[O-2]479%11.CCCC[N+](CCCC)(CCCC)CCCC": 134,
  "COC(=O)c1ccc2cc(C(=O)OC)ccc2c1": 135,
  "Cc1cc(C)c(-[n+]2cn3c(n2)COC2Cc4ccccc4C23)c(C)c1.F[B-](F)(F)F": 136,
  "I[NH4]": 137,
  "[Br-].[Br-].[Co+2]": 138,
  "c1cc(-c2ccncc2)ccn1": 139,
  "CC(=O)[O-].CC(=O)[O-].[Cu+2]": 140,
  "CCCCCCCC[N+](CCCCCCCC)(CCCCCCCC)CCCCCCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])([O-])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O-]": 141,
  "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])(=[O])[O-].[O]=[W](=[O])([O-])[O][W](=[O])(=[O])[O][W](=[O])(=[O])[O-]": 142,
  "C[Si](C)(C)Cl": 143,
  "Cc1c(C)c(C)[c-](C)c1C.[Cl][Rh]([Cl])[Rh]([Cl])[Cl]": 144,
  "N#Cc1c(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c(C#N)c(-n2c3ccccc3c3ccccc32)c1-n1c2ccccc2c2ccccc21": 145,
  "N#Cc1c(-n2c3ccccc3c3ccccc32)c(C#N)c(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c1-n1c2ccccc2c2ccccc21": 146,
  "N#Cc1c(-n2c3ccccc3c3ccccc32)nc(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c1C#N": 147,
  "[Br-][Ni+2]12([Br-])[N]3=CC=CN3C4=CC=CC(N5C=CC=[N]51)=[N]42": 148,
  "[Cl-].[Cl-].[Ru+2].c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1": 149,
  "BrCCBr": 150,
  "CC(C)(C)c1ccc2[O-]->[Co+2]34<-[O-]c5ccc(C(C)(C)C)cc5C=[N]->3C(C)(C)C(C)(C)[N]->4=Cc2c1": 151,
  "O=C(O)c1ccccc1-c1c2cc(Br)c(=O)cc-2oc2cc(O)c(Br)cc12": 152,
  "O=C1C=CC(C2(c3ccccc3)c3ccc(C(=O)[O-])cc3Oc3c(Br)cccc32)C=C1.[Na+]": 153,
  "[Cl-].[Cl-].[Cl-].[Fe+3]": 154,
  "Brc1ccc(N(c2ccc(Br)c(Br)c2)c2ccc(Br)cc2Br)c(Br)c1": 155,
  "CC#[N]->[Rh+]12(<-[N]#CC)([c]3cc([Si](C)(C)C)ccc3-c3n(C)cc[n]->13)[c]1cc([Si](C)(C)C)ccc1-c1n(C)cc[n]->21.F[P-](F)(F)(F)(F)F": 156,
  "CC(C)c1cc(-c2cc3ccccc3c3c2OP(=O)(O)c2c(-c4cc(C(C)C)cc(C(C)C)c4)cc4ccccc4c2-3)cc(C(C)C)c1": 157,
  "CCCC[N+](CCCC)(CCCC)CCCC.[Br-]": 158,
  "COC(=O)c1ccc(C(C)(C)C)cc1": 159,
  "O.O.O.O.O.O.O=[N+]([O-])[O-].O=[N+]([O-])[O-].[Ni+2]": 160,
  "c1ccc(-c2cccc[n]2->[Ir]23([c]4ccccc4-c4cccc[n]->24)[c]2ccccc2-c2cccc[n]->32)cc1": 161,
  "Brc1ccc(Br)c(N(c2cc(Br)ccc2Br)c2cc(Br)ccc2Br)c1": 162,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].[Ni+2]": 163,
  "CC(C)c1cc(C(C)C)c(-c2cc3c(c4c2OP(=O)(O)Oc2c(-c5c(C(C)C)cc(C(C)C)cc5C(C)C)cc5c(c2-4)CCCC5)CCCC3)c(C(C)C)c1": 164,
  "CCN(CC)c1ccc2c(-c3ccccc3C(=O)O)c3ccc(=[N+](CC)CC)cc-3oc2c1": 165,
  "Cc1cc(C)c(-c2c3ccc(C)cc3[n+](C)c3cc(C)ccc23)c(C)c1.[O-][Cl+3]([O-])([O-])[O-]": 166,
  "N#Cc1cc(C#N)c(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c1-n1c2ccccc2c2ccccc21": 167,
  "O.[Br-].[Br-].[Ni+2]": 168,
  "O=P1(O)Oc2ccc3ccccc3c2-c2c(ccc3ccccc23)O1": 169,
  "c1ccc(-c2cc(-c3ccccc3)[o+]cc(-c3ccccc3)c2)cc1.F[B-](F)(F)F": 170,
  "*N(c1ccc(OC)cc1)c1ccc(OC)cc1": 171,
  "C1=CC2=C(c3ccccc3)C3=NC(=C(c4ccccc4)C4=NC(=C(c5ccccc5)C5=NC(=C(c6ccccc6)C1=N2)C=C5)C=C4)C=C3.[Cl][Mn]": 172,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.[Br-].[Br-].[Ni+2]": 173,
  "CC(C)C(=O)Nc1cccc(-c2c3nc(c(-c4cc(C(C)(C)C)cc(C(C)(C)C)c4)c4ccc([nH]4)c(-c4cccc(NC(=O)C(C)C)c4NC(=O)C(C)C)c4nc(c(-c5cc(C(C)(C)C)cc(C(C)(C)C)c5)c5ccc2[nH]5)C=C4)C=C3)c1NC(=O)C(C)C.[Cl][Mn]": 174,
  "CCCC[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 175,
  "COc1ccc(N2c3ccc(SC)cc3Sc3cc(SC)ccc32)cc1": 176,
  "C[C](=O)[Cu]": 177,
  "Cc1c(C)c(C)[c-](C)c1C.Cc1c(C)c(C)[c-](C)c1C.[Cl][Rh+][Cl].[Cl][Rh+][Cl]": 178,
  "O=C([O-])c1ccccc1-c1c2cc(Br)c(=O)c(Br)c-2oc2c(Br)c([O-])c(Br)cc12.[Na+].[Na+]": 179,
  "O=C([O-])c1ccccc1-c1c2cc(I)c(=O)c(I)c-2oc2c(I)c([O-])c(I)cc12": 180,
  "Oc1ccccc1C=NCCN=Cc1ccccc1O.[Co]": 181,
  "[Cl][Co][Cl]": 182,
  "[Fe+2].[cH-]1[cH-][cH-][cH-][cH-]1.[cH-]1[cH-][cH-][cH-][cH-]1": 183,
  "[Ir+3].c1ccc(-c2ccccn2)cc1.c1ccc(-c2ccccn2)cc1.c1ccc(-c2ccccn2)cc1": 184,
  "[O]=[Fe][O][Fe]=[O]": 185,
  "*CCC1C2=C(C)C3=[N+]4C(=CC5=[N+]6C(=C(C)C7=[N+]8C(C(C*)C7(C)CCC(=O)OC)C(C)([N]2[Co]648)C1(C)C*)C(CCC(=O)OC)C5(C)C)C(CCC(=O)OC)C3(C)CC(=O)OC": 186,
  "CC(=O)[O-].CC(=O)[O-].[Mn+2]": 187,
  "CC(C)(C)c1cc[n+]2c(c1)-c1cc(C(C)(C)C)cc[n+]1[Ni]21<-[Br][Ni]2(<-[Br]1)[n+]1ccc(C(C)(C)C)cc1-c1cc(C(C)(C)C)cc[n+]12": 188,
  "CC1=C(C)[C](C)([Rh]([Cl])([Cl])[Rh]([Cl])[Cl])C(C)=C1C.Cc1c(C)c(C)[c-](C)c1C": 189,
  "CC[N+](CC)(CC)CC.[Cl-]": 190,
  "CN(C)c1ccc2nc3ccc(=[N+](C)C)cc-3sc2c1": 191,
  "COC(=O)c1ccc(C(=O)OC)cc1": 192,
  "COc1c(I)cc2c(c1I)-c1c(cc(I)c(OC)c1I)[C@H](O)[C@H]2O": 193,
  "Cc1cc(C)c(-c2c3nc(c(-c4c(C)cc(C)cc4C)c4ccc([nH]4)c(-c4c(C)cc(C)cc4C)c4nc(c(-c5c(C)cc(C)cc5C)c5ccc2[nH]5)C=C4)C=C3)c(C)c1.[Cl][Mn]": 194,
  "Cc1cc(C)c(-n2c3ccccc3c3ccccc32)c(C)c1.Cc1cc(C)c(-n2c3ccccc3c3ccccc32)c(C)c1.[O-][Cl+3]([O-])([O-])[O-]": 195,
  "Cc1ccc(N(c2ccc(C)cc2)c2ccc(C)cc2)cc1": 196,
  "O=S(=O)(O)C(F)(F)F.[Y]": 197,
  "[Fe+2].c1ccc2c(c1)-c1nc-2nc2[n-]c(nc3nc(nc4[n-]c(n1)c1ccccc41)-c1ccccc1-3)c1ccccc21": 198,
  "[K][I]": 199,
  "c1ccc(-c2cc(-c3ccccc3)[o+]c(-c3ccccc3)c2)cc1": 200,
  "CC(=O)O.[Cu]": 201,
  "CC1(C)[N+]2=Cc3ccccc3[O][Co]23[O]c2ccccc2C=[N+]3C1(C)C": 202,
  "CCCC(=O)OCC(OC(=O)CCC)C(OC(=O)CCC)C(Cn1c2nc(=O)[nH]c(=O)c-2nc2cc(C)c(C)cc21)OC(=O)CCC": 203,
  "Cc1cc(C)c(-[n+]2c3ccccc3cc3ccccc32)c(C)c1.Cc1cc(C)c(-[n+]2c3ccccc3cc3ccccc32)c(C)c1.[O-][Cl+3]([O-])([O-])[O-]": 204,
  "Fc1ccc(SS[S+](c2ccc(F)cc2)c2ccc(F)cc2)cc1": 205,
  "N#CC1=C(C#N)C(Cl)=C(Cl)C(=O)C1=O": 206,
  "O.O.O.[Li+].[O-][Cl+3]([O-])([O-])[O-]": 207,
  "O=C1C(=O)c2ccccc2-c2ccccc21": 208,
  "[Cl-].[Cl-].[Cu+2]": 209,
  "[Cl-].[Cu+]": 210,
  "[Cl][Cu][Cl]": 211,
  "c1ccc2c(c1)-c1nc3c4ccccc4c4nc5[n]6->[Fe+2]7(<-[n]1c-2nc1c2ccccc2c(nc6-c2ccccc2-5)[n-]->71)<-[n-]34": 212,
  "CC(=O)O.O.[Mn]": 213,
  "CC(=O)O.[Na]": 214,
  "CC(=O)[O-].CC(=O)[O-].O.O.O.O.[Ni+2]": 215,
  "CC(C)(C)c1cc2c(c(C(C)(C)C)c1)[O][Co]13<-[N](=C2)C(C)(C)C(C)(C)[N]->1=Cc1cc(C(C)(C)C)cc(C(C)(C)C)c1[O]3": 216,
  "CC(CC(C)P(c1ccccc1)c1ccccc1)P(c1ccccc1)c1ccccc1": 217,
  "C[N+](C)(C)Cc1ccccc1.[OH-]": 218,
  "Cc1ccc2c(c1)C(C(F)(F)F)(C(F)(F)F)c1ccccc1-c1ccccc1[N-]2.Cc1ccc2c(c1)C(C(F)(F)F)(C(F)(F)F)c1ccccc1-c1ccccc1[N-]2.N#C[S-].[Rh+3]": 219,
  "Cc1nnn[nH]1": 220,
  "F[P-](F)(F)(F)(F)F.c1cc[c]([Fe+][c]2ccccc2)cc1": 221,
  "N": 222,
  "O=C1C2=C(OC(Br)(Br)C2(Br)Br)c2c1c(=O)oc1ccc(O)cc21": 223,
  "[Ag]": 224,
  "[Cl][Au][PH](c1ccccc1)(c1ccccc1)c1ccccc1": 225,
  "[Cl][Ce]([Cl])[Cl]": 226,
  "Br[Ni](Br)(n1cc(c2ncccn2)cc(c2ncccn2)c1)": 227,
  "Brc1ccc(N(c2ccccc2)c2ccccc2)cc1": 228,
  "CC#N.CC(c1ccccn1)(c1ccccn1)c1cccc(-c2ccccn2)n1.F[P-](F)(F)(F)(F)F.F[P-](F)(F)(F)(F)F.[Ni+2]": 229,
  "CC#[N]->[Cu+2]123<-[n]4c5cccc4C[N]->1(C)CC[N]->2(C)CC[N]->3(C)C5.[O-][Cl+3]([O-])([O-])[O-]": 230,
  "CC(=O)NC1CC2(CCCCC2)N([O])C2(CCCCC2)C1": 231,
  "COCCOC.[Cl-].[Cl-].[Ni+2]": 232,
  "Cc1ccc2c(-c3c(C)cccc3C)c3ccc(C)cc3[n+](C)c2c1.[O-][Cl+3]([O-])([O-])[O-]": 233,
  "Cc1cccc(C)n1": 234,
  "Cn1cncc1-c1c(F)cncc1NC(=O)c1c(N)nn2cc(F)cnc12": 235,
  "N#Cc1cc(C#N)c(N(c2ccccc2)c2ccccc2)c(N(c2ccccc2)c2ccccc2)c1N(c1ccccc1)c1ccccc1": 236,
  "O.O.[K+].[K+].[O]=[Os](=[O])([O-])[O-]": 237,
  "O=C1OC2(c3ccccc31)c1cc(Br)c(O)c(Br)c1Oc1c2cc(Br)c(O)c1Br.[Na]": 238,
  "[Br][Fe][Br]": 239,
  "[Br][Ni][Br].c1ccc(-c2ccccn2)nc1": 240,
  "[CH]1C=CC=C1.[CH]1C=CC=C1.[Fe]": 241,
  "[Cl-].[Cl-].c1ccc(-n2ccc[c]2[Ru+2]([c]2cccn2-c2ccccn2)[c]2cccn2-c2ccccn2)nc1": 242,
  "[Cl-][Au+][P](C=1C=CC=CC1)(C=2C=CC=CC2)C=3C=CC=CC3": 243,
  "[Cl][Ni][Cl].c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1": 244,
  "[Na][Br]": 245,
  "[Ni]": 246,
  "c1ccc(-c2cc(-c3ccccc3)oc(-c3ccccc3)c2)cc1.F[B-](F)(F)F": 247,
  "c1ccc(-c2ccccn2[Ir](n2cccc2-c2ccccc2)(n2cccc2-c2ccccc2)n2cccc2-c2ccccc2)cc1": 248,
  "c1ccc2c(c1)Sc1ccccc1S2": 249,
  "*CC(=O)OC.O": 250,
  "C1CN2CCN1CC2": 251,
  "CC#N.CC(c1ccccn1)(c1ccccn1)c1cccc(C(C)(c2ccccn2)c2ccccn2)n1.F[P-](F)(F)(F)(F)F.F[P-](F)(F)(F)(F)F.[Ni+2]": 252,
  "CC#[N]->[Ir+]12(<-[N]#CC)([c]3cc(C(C)(C)C)ccc3-c3n(C)cc[n]->13)[c]1cc(C(C)(C)C)ccc1-c1n(C)cc[n]->21.F[P-](F)(F)(F)(F)F": 253,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].[Fe+3]": 254,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].O.O.O.O.[Mn+2]": 255,
  "CC(=O)O.[Mn]": 256,
  "CC(=O)[O-].CC(=O)[O-].CC(=O)[O-].[Mn+3]": 257,
  "CC(C)(C)c1cc2C=[N]3C(C)(C)C(C)(C)[N]4=Cc5cc(C(C)(C)C)cc(C(C)(C)C)c5[O-]->[Co+2]<-3<-4<-[O-]c2c(C(C)(C)C)c1": 258,
  "CC(C)(C)c1cc2c(c(C(C)(C)C)c1)[O][Co]13[O]c4c(cc(C(C)(C)C)cc4C(C)(C)C)C=[N+]1c1ccccc1[N+]3=C2": 259,
  "CC(C)(C)c1cccc(C2=N[C@H](c3ccccc3)CO2)c1O": 260,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.F[P-](F)(F)(F)(F)F.[Ir+3].c1ccc(-c2ccccn2)cc1.c1ccc(-c2ccccn2)cc1": 261,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.[Br][Ni][Br]": 262,
  "CC1=[N]2->[Ni+2]34<-[N](=C(C)c5cccc1[n]->35)CCC[NH]->4CCC2.[O-][Cl+3]([O-])([O-])[O-]": 263,
  "CCC(CC)(O[Si](C)(C)C)C1CCCN1": 264,
  "CCOCC.FB(F)F": 265,
  "CC[N+](CC)(CC)CC.F[P-](F)(F)(F)(F)F": 266,
  "CN(C)c1ccc2c(c1)Sc1cc(N(C)C)ccc1=N2": 267,
  "COC(=O)CC[C@@H]1C2=[N]3->[Co+3]45<-[N]6=C(C=C3C1(C)C)[C@@H](CCC(=O)OC)[C@](C)(CC(=O)OC)C6=C(C)C1=[N]->4[C@@](C)([C@H]3[C@H](CC(=O)OC)[C@@](C)(CCC(=O)OC)C(=C2C)[N-]->53)[C@@](C)(CC(=O)OC)[C@@H]1CCC(=O)OC.[O-][Cl+3]([O-])([O-])[O-]": 268,
  "COC(=O)c1ccc(N(c2ccc(C(=O)OC)cc2)c2ccc(C(=O)OC)cc2)cc1": 269,
  "COC1=CC=C(S(=O)(=O)Nc2ccc[cH]2[Fe][cH]2cccc2)C=C1": 270,
  "COc1ccc(N(c2ccc(OC)cc2)c2ccc(OC)cc2)cc1": 271,
  "Cc1cc(C)c(-c2c3ccccc3[n+](-c3ccccc3)c3ccccc23)c(C)c1.F[B-](F)(F)F": 272,
  "Cc1cc(C)c(-n2c3ccccc3c3ccccc3c2C)c(C)c1.[O-]Cl(=O)(=O)=O": 273,
  "Cc1cc(C)cc(-n2c3ccccc3c3ccccc3c2C)c1.[O-]Cl(=O)(=O)=O": 274,
  "F[P-](F)(F)(F)(F)F.c1cc[c]([Fe+2][c]2ccccc2)cc1": 275,
  "N#Cc1cc(C#N)c(-n2c3ccccc3c3ccccc32)c(-n2c3ccccc3c3ccccc32)c1-n1c2ccccc2c2ccccc21.[*:0]": 276,
  "O.O.O.O.O.O.[Cl][Ni][Cl]": 277,
  "O.O.O.[Br-].[Br-].[Ni+2]": 278,
  "O.[Br][Mn][Br]": 279,
  "O=C(O)c1ccccc1-c1c2cc(O)c(=O)cc-2oc2cc(O)ccc12": 280,
  "O=C(O)c1ccccc1C1c2ccc(O)cc2Oc2cc(O)ccc21": 281,
  "O=C([O-])c1ccccc1-c1c2cc(Br)c(=O)c(Br)c-2oc2c(Br)c(O)c(Br)cc12": 282,
  "O=C1C=CC(=C(c2ccccc2C(=O)O)c2ccccc2C(=O)O)C=C1": 283,
  "O=c1c2ccccc2sc2ccccc12": 284,
  "Pt": 285,
  "[Cl-][Rh+3]12345([Cl-][Rh+3]6789([Cl-])([Cl-]1)C=%10(C)C9(C)=C8(C)[C-]7(C)C%106C)C=%11(C)C5(C)=C4(C)[C-]3(C)C%112C": 286,
  "[Cl][Ni][Cl].c1cc(-n2cccn2)nc(-n2cccn2)c1": 287,
  "[Cu][Br]": 288,
  "[Cu][I]": 289,
  "[Fe+2].c1ccc(-c2ccc[cH-]2)cc1.c1ccc(-c2ccc[cH-]2)cc1": 290,
  "[Fe+2].c1ccccc1.c1ccccc1.c1ccccc1.c1ccccc1": 291,
  "[I-].[I-].[Ni+2]": 292,
  "[Ir+3].[c-]1ccccn1-c1ccccc1.[c-]1ccccn1-c1ccccc1.[c-]1ccccn1-c1ccccc1": 293,
  "[Li].[O-][Cl+3]([O-])([O-])O": 294,
  "[Li][I]": 295,
  "[Pd]": 296,
  "c1cc2c(cc1O)c1c3c(c(=O)c(c-2cc1=O)C(=O)O)C(=C(C=C3)Br)Br": 297,
  "c1ccc(-c2ccnc3c2ccc2c(-c4ccccc4)ccnc23)cc1": 298,
  "*C(c1ccccc1)(c1ccccc1)C1CCCN1": 299,
  "*CC(*)C(*)C(*)*": 300,
  "BrC1=CC=C(C(=C1)N(C2=CC=C(C=C2Br)C=C(Br)C=C2Br)C3=CC=C(C=C3Br)C=C(Br)C=C3Br)Br": 301,
  "Br[Ni](Br)(n1ccccc1-c1ccccn1)": 302,
  "Brc1ccc(N(c2cc(Br)ccc2Br)c2cc(Br)ccc2Br)c(Br)c1": 303,
  "Brc1ccc(N(c2ccc(Br)cc2Br)c2cc(Br)ccc2Br)c(Br)c1": 304,
  "Brc1ccc(N(c2ccccc2Br)c2ccc(Br)cc2Br)cc1": 305,
  "Brc1ccn(-c2cc(-c3ccccn3)ccn2)c1.[Br][Ni][Br]": 306,
  "C/C=C/c1ccccc1": 307,
  "C1=CC2=C3C=CC=C3[C]34->[Fe+2]([C]2=C1)[C]1=CC=CC1=C3C=CC=4": 308,
  "C1=CCCC=CCC1.C1=CCCC=CCC1.[Ni]": 309,
  "C1=CSC(=C2SC=CS2)S1": 310,
  "C1=[N+]2C(c3ccccc3)C(c3ccccc3)[N+]3=Cc4ccccc4[O][Co]23[O]c2ccccc21": 311,
  "C1=[N+]2CC[N+]3=Cc4ccccc4[O][Co]23[O]c2ccccc21": 312,
  "C1=[N+]2c3ccccc3[N+]3=Cc4ccccc4[O][Co]23[O]c2ccccc21": 313,
  "C1CCC(P(C2CCCCC2)C2CCCCC2)CC1.[Cl][Ni][Cl]": 314,
  "C1COCCO1.[Cl][Ni][Cl]": 315,
  "C=C(C)C(=O)N(Cc1ccccc1)C(=C)c1ccc(F)cc1": 316,
  "C=C(C)c1ccccc1NC(=O)[C@H]1CC[C@H](C)[C@H]2CC[C@H](COC(C)=O)C(=O)O[C@H]21": 317,
  "CC#N.CC#N.CC#N.CC#N.F[P-](F)(F)(F)(F)F.[Cu+]": 318,
  "CC#[N]->[Rh+]12(<-[N]#CC)([c]3cc(C(C)(C)C)ccc3-c3n(C)cc[n]->13)[c]1cc(C(C)(C)C)ccc1-c1n(C)cc[n]->21.F[P-](F)(F)(F)(F)F": 319,
  "CC(=O)C=C(C)[C](=O)[Cu]<-[O]=C(C)C=C(C)C(=O)O": 320,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].[Ce+3]": 321,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].O.[Ni+2]": 322,
  "CC(=O)C=C(C)[O-].CC(=O)C=C(C)[O-].[Mn+2]": 323,
  "CC(=O)C=C(C)[O][Cu][O]C(C)=C(C)C(C)=O": 324,
  "CC(=O)CC(C)=O.CC(=O)CC(C)=O.O.O.O.O.[Mn+2]": 325,
  "CC(=O)N(C)C": 326,
  "CC(=O)NC1CC2(CCCCC2)N([O-])C2(CCCCC2)C1": 327,
  "CC(=O)NC1CCC2(CCCCC2)N(O)C2(CCCCC2)C1": 328,
  "CC(=O)N[C@@H]1CCC2(CC1)N1(OC2)CCC2(CC1)CCCC2": 329,
  "CC(=O)Nc1cccc2c1C3(CCCCCC3)Oc2": 330,
  "CC(=O)O.O.[Co]": 331,
  "CC(=O)[C-](C)[O][Cu+2]([O][C-](C)C(C)=O)[O][C-](C)C(C)=O": 332,
  "CC(=O)[O-].CC(=O)[O-].CC(C)c1ccc2c(c1)OC(=O)C2c1ccccc1.[Co+2]": 333,
  "CC(=O)[O-].CC(=O)[O-].[Ni+2]": 334,
  "CC(=O)[O-].CCCC[N+](CCCC)(CCCC)CCCC": 335,
  "CC(=O)[O][Ni]12[n]3c(c4ccccc4c3=Nc3cc(C)cc[n+]31)=Nc1cc(C)cc[n+]12": 336,
  "CC(C)(C)C(=O)[O][Pd][O]C(=O)C(C)(C)C": 337,
  "CC(C)(C)[Si](C)(C)OC(c1ccccc1)(c1ccccc1)C1CCCN1": 338,
  "CC(C)(C)c1cc(-c2c3nc(c(-c4c(Br)cccc4Br)c4ccc([nH]4)c(-c4cc(C(C)(C)C)cc(C(C)(C)C)c4)c4nc(c(-c5c(Br)cccc5Br)c5ccc2[nH]5)C=C4)C=C3)cc(C(C)(C)C)c1.[Cl][Mn]": 339,
  "CC(C)(C)c1cc(/C=N/[C@@H]2CCCC[C@H]2/N=C/c2cc(C(C)(C)C)c(O)c(C(C)(C)C)c2)c([O][Mn+3])c(C(C)(C)C)c1.[Cl-]": 340,
  "CC(C)(C)c1cc(C=NC(C)(C)C(C)(C)N=Cc2cc(C(C)(C)C)cc(C(C)(C)C)c2[O-])c([O-])c(C(C)(C)C)c1.[Co+2]": 341,
  "CC(C)(C)c1cc(C=N[C@@H]2CCCC[C@H]2N=Cc2cc(C(C)(C)C)cc(C(C)(C)C)c2[O-])c([O-])c(C(C)(C)C)c1.[Cl-].[Mn+3]": 342,
  "CC(C)(C)c1cc2c(c(C(C)(C)C)c1)[O][Co]13<-[N](=C\\2)/CCCC/[N]->1=C\\c1cc(C(C)(C)C)cc(C(C)(C)C)c1[O]3": 343,
  "CC(C)(C)c1cc2c(c(C(C)(C)C)c1)[O][Co]13[O]c4c(cc(C(C)(C)C)cc4C(C)(C)C)C=[N+]1C1CCCCC1[N+]3=C2": 344,
  "CC(C)(C)c1ccc2c3ccc(C(C)(C)C)cc3n(-c3c(C#N)c(C#N)c(-n4c5cc(C(C)(C)C)ccc5c5ccc(C(C)(C)C)cc54)c(-n4c5cc(C(C)(C)C)ccc5c5ccc(C(C)(C)C)cc54)c3-n3c4cc(C(C)(C)C)ccc4c4ccc(C(C)(C)C)cc43)c2c1": 345,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)cc[n]2->[Ir+3]23(<-[cH]4cc(F)cc(F)c4-c4ccnc[c]->24C(F)(F)F)<-[cH]2cc(F)cc(F)c2-c2ccnc[c]->32C(F)(F)F)c1.F[P-](F)(F)(F)(F)F": 346,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.Cc1ccc(-c2cc(F)cc(F)[c]2[Ir])nc1.Cc1ccc(-c2cc(F)cc(F)[c]2[Ir])nc1.F[P-](F)(F)(F)(F)F.[Ir+3]": 347,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.F[P-](F)(F)(F)(F)F.Fc1cc(F)c(-c2cc(C(F)(F)F)cn[c]2[Ir+3])c(F)c1.Fc1cc(F)c(-c2cc(C(F)(F)F)cn[c]2[Ir+3])c(F)c1": 348,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.F[P-](F)(F)(F)(F)F.Fc1ccc(-c2cc(C(F)(F)F)ccn2)c(F)c1.Fc1ccc(-c2cc(C(F)(F)F)ccn2)c(F)c1.[Ir+3]": 349,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.F[P-](F)(F)(F)(F)F.[Ir].c1ccc(-c2ccccn2)cc1.c1ccc(-c2ccccn2)cc1": 350,
  "CC(C)(C)c1ccnc(-c2cc(C(C)(C)C)ccn2)c1.[Br][Co][Br]": 351,
  "CC(C)(C)c1ccnc(-c2ccnc(C(C)(C)C)c2)c1": 352,
  "CC(C)c1ccc(C(C)C)cc1.CC(C)c1ccc(C(C)C)cc1.[Cl-].[Cl-].[Cl-].[Cl-].[Ru+2]": 353,
  "CC(CC(C)P(c1ccccc1)c1ccccc1)P(c1ccccc1)c1ccccc1.[Br-].[Br-].[Co+2]": 354,
  "CC(c1ccccn1)(c1ccccn1)c1cccc(-c2ccccn2)n1.[Ni]": 355,
  "CC1(C(=O)O)CCCN1": 356,
  "CC1(C)CCCC(C)(C)N1O": 357,
  "CC1(C)Oc2ccccc2C=[N+]2[C@H](O1)[C@H]2c1ccccc1.c1ccc([B-](c2ccccc2)(c2ccccc2)c2ccccc2)cc1": 358,
  "CC1(C)[N]2=Cc3ccccc3[O-]->[Co+2]<-23<-[O-]c2ccccc2C=[N]->3C1(C)C": 359,
  "CC1(C)c2cc(C(=O)O)c(Br)cc2Oc2c(Br)cccc21": 360,
  "CC1(C)c2ccc(C(=C3C=CC(=O)C=C3)c3ccc([O-])cc3)cc2Oc2c(Br)cccc21.[Na+]": 361,
  "CC1=C(C)[C](C)([Rh]([Cl])([Cl])[Rh]([Cl])([Cl])[C]2(C)C(C)=C(C)C(C)=C2C)C(C)=C1C": 362,
  "CC1=C(c2ccc(F)cc2)N(Cc2ccccc2)C(=O)C1(C)CSC#N": 363,
  "CC1=C2C=CC(=N2)C(C)=C2C=CC(=N2)C(C)=C2C=CC(=N2)C(C)=C2C=CC1=N2.[Cl][Mn]": 364,
  "CC1=[N+]2O[H]O[N+]3=C(C)C(C)=[N+]4O[H]O[N+](=C1C)[Co]234([Cl])[n+]1ccccc1": 365,
  "CC1CC(C)(C)[NH]2->[Ni+2]34<-[NH]1CC[NH]->3C(C)(C)CC(C)[NH]->4CC2.[O-][Cl+3]([O-])([O-])[O-]": 366,
  "CC1[CH-][C](=O)[Co+2]2(<-[O]=1)<-[O]=C(C)[CH-]C(C)=[O]->2": 367,
  "CCC(=O)[O-].CCC(=O)[O-].[Pd+2]": 368,
  "CCCC(=O)OCC(OC(=O)CCC)C(OC(=O)CCC)C(Cn1c(=O)[nH]c(=O)c2nc3cc(C)c(C)cc3nc21)OC(=O)CCC": 369,
  "CCCC(=O)OCC(OC(=O)CCC)C(OC(=O)CCC)C(OC(=O)CCC)n1c(=O)[nH]c(=O)c2nc3cc(C)c(C)cc3n21": 370,
  "CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-].[O]=[W]([O-])([O-])[O-]": 371,
  "CCCC[N+](CCCC)(CCCC)CCCC.[O]=[W](=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])[O][W](=[O])(=[O])(=[O])=[O]": 372,
  "CCN(CC)c1ccc2c(-c3ccccc3C(=O)O)c3ccc(=[N+](CC)CC)cc-3oc2c1.[Cl-]": 373,
  "CC[C@H]1CN2CC[C@H]1C[C@@H]2[C@@H](Oc1nnc(O[C@@H](c2ccnc3ccc(OC)cc23)[C@H]2C[C@@H]3CCN2C[C@@H]3CC)c2ccccc12)c1ccnc2ccc(OC)cc12": 374,
  "CC[N+](CC)(CC)CC.[Br-]": 375,
  "CCc1ccc[cH]1[Fe][cH]1cccc1": 376,
  "COC(=O)c1ccc(C#N)cc1": 377,
  "COC(=O)c1ccc(C)cc1": 378,
  "COC(=O)c1ccc2ccccc2c1": 379,
  "COC(=O)c1cccc(C(=O)OC)c1": 380,
  "COC(=O)c1ccccc1C(=O)OC": 381,
  "COC(c1ccccc1)(c1ccccc1)C1CCCN1": 382,
  "COc1ccc(N(C)c2ccc(OC)cc2)cc1": 383,
  "COc1ccc(N(c2ccc(Cl)cc2)c2ccc(OC)cc2)cc1": 384,
  "COc1ccc(N(c2ccc(OC)cc2)c2ccc(C(C)(C)C)cc2)cc1": 385,
  "COc1ccc(N2c3cc(OC)ccc3Sc3ccc(OC)cc32)cc1": 386,
  "COc1ccc(N2c3ccc(OC)cc3Sc3cc(OC)ccc32)cc1": 387,
  "COc1ccc2c(c1)N(c1ccc(C(C)(C)C)cc1)c1cc(OC)ccc1S2": 388,
  "COc1ccc2c(c1OC)Nc1ccc(C(C)(C)C)cc1S2": 389,
  "COc1cccc(OC)c1I": 390,
  "C[C-](C)C(C)(C)C.C[C-](C)C(C)(C)C.F[P-](F)(F)(F)(F)F.[Fe+2]": 391,
  "C[C-](C)C(C)(C)C1=C(C)C(C)=C(C)[C-]1(C)C.[Fe+2].F[P-](F)(F)(F)(F)F": 392,
  "C[C@@H]1CCC[C@H](C)N1C1C(N2[C@H](C)CCC[C@@H]2C)C1N1[C@H](C)CCC[C@@H]1C": 393,
  "C[C@H](C[C@H](C)P(c1ccccc1)c1ccccc1)P(c1ccccc1)c1ccccc1.[Br-].[Br-].[Co+2]": 394,
  "C[IH][Fe]([CH2]I)[CH2]I": 395,
  "C[N+](=O)[O-]": 396,
  "C[O-].[Li+]": 397,
  "C[Si](C)(C)OC(c1ccccc1)(c1ccccc1)[C@@H]1CCCN1": 398,
  "Cc1c(C)c(C)[c-](C)c1C.Cc1c(C)c(C)[c-](C)c1C.F[P-](F)(F)(F)(F)F.[Fe+2]": 399,
  "Cc1c(C)c(C)[c-](C)c1C.Cc1c(C)c(C)[c-](C)c1C.[Cl-].[Cl-].[Rh+2]": 400,
  "Cc1c(C)c(C)[c-](C)c1C.Cc1c(C)c(C)[c-](C)c1C.[Cl][Ir][Cl].[Cl][Ir][Cl]": 401,
  "Cc1c(C)c(C)[c-](C)c1C.[C-]#[O+].[Co+3].[I-].[I-]": 402,
  "Cc1c(C)c(C)[c-](C)c1C.[Cl-].[Cl-].[Cl-].[Cl-].[Ir+2].[Ir+2]": 403,
  "Cc1c(C)c(C)[c-](C)c1C.[Cl-].[Cl-].[Cl-].[Cl-].[Rh+2].[Rh+2]": 404,
  "Cc1c(C)c(C)[c-](C)c1C.[Cl-].[Cl-].[Ir+3]": 405,
  "Cc1cc(C(C)(C)C)ccn1-c1ccc(C(C)(C)C)cn1": 406,
  "Cc1cc(C)c(-n2c[n+]3c(n2)COCC3)c(C)c1.F[B-](F)(F)F": 407,
  "Cc1cc(C)cc(C)c1-n1c2ccccc2c2ccccc2c1C.[O-]Cl(=O)(=O)=O": 408,
  "Cc1cc(F)c[cH]2->[Ir+3]3([c]4cnccc4-c12)([c]1cnccc1-c1c(C)cc(F)c[cH]->31)<-[n]1ccc(C(C)(C)C)cc1-c1cc(C(C)(C)C)ccn1.F[P-](F)(F)(F)(F)F": 409,
  "Cc1cc(O[C@@H](C)C(=O)Nc2c(C(C)C)cccc2C(C)C)c(I)c(O[C@@H](C)C(=O)Nc2c(C(C)C)cccc2C(C)C)c1": 410,
  "Cc1cc2c(n1)ccc1c2cc(C)nc1": 411,
  "Cc1cc2ccccc2c2c1OP(=O)(O)Oc1c(C)cc3ccccc3c1-2": 412,
  "Cc1ccc(-c2cc3ccccc3c3c2OP(=O)(O)Oc2c(-c4ccc(C)cc4)cc4ccccc4c2-3)cc1": 413,
  "Cc1ccc(C(C)C)cc1.[Cl-].[Cl-].[Cl-].[Cl-].[Ru+2].[Ru+2]": 414,
  "Cc1ccc(C(C)C)cc1.[I-].[I-].[I-].[I-].[Os+2].[Os+2]": 415,
  "Cc1ccc(N(c2ccc(C)cc2)c2ccc(Br)cc2)cc1": 416,
  "Cc1ccc(N(c2ccccc2)c2ccc(C)cc2)cc1": 417,
  "Cc1ccc(N2c3ccccc3Sc3ccccc32)cc1": 418,
  "Cc1cccc(-c2cccc(C)n2)n1": 419,
  "ClCCl": 420,
  "Cn1c(-c2ccc(Br)cc2)nc2c3ccccc3c3ccccc3c21": 421,
  "FC(c1ccccc1)(c1ccccc1)C1CCCN1": 422,
  "F[P-](F)(F)(F)(F)F.Fc1cc(F)c2-c3ccnc[c]3(C(F)(F)F)->[Ir+3]3(<-[cH]2c1)(<-[cH]1cc(F)cc(F)c1-c1ccnc[c]->31C(F)(F)F)<-[n]1ccccc1-c1ccccn1": 423,
  "F[P-](F)(F)(F)(F)F.Fc1cc[c-]c(-c2cc(C(F)(F)F)ccn2)c1.Fc1cc[c-]c(-c2cc(C(F)(F)F)ccn2)c1.[Ir+3].c1ccc(-c2ccccn2)nc1": 424,
  "Fc1c(F)c(F)c(B(c2c(F)c(F)c(F)c(F)c2F)c2c(F)c(F)c(F)c(F)c2F)c(F)c1F": 425,
  "Fc1ccc(SSc2ccc(F)cc2)cc1": 426,
  "Ic1ccc(N(c2ccc(I)cc2)c2ccc(I)cc2)cc1": 427,
  "N#Cc1c2ccccc2c(C#N)c2ccccc12": 428,
  "N#Cc1ccc(C#N)cc1": 429,
  "N#Cc1ccccc1.N#Cc1ccccc1.[Cl][Pd][Cl]": 430,
  "O": 431,
  "O.O.O.O.O.O.[Cl-].[Cl-].[Co+2]": 432,
  "O.O.O.O.O.O.[Cl][Co][Cl]": 433,
  "O.O.O.O.O.O.[I-].[I-].[Ni+2]": 434,
  "O.O.O.O.O.O.[Ni+2].[O-][Cl+3]([O-])([O-])[O-].[O-][Cl+3]([O-])([O-])[O-]": 435,
  "O.[Br-].[Br-].[Br-].[Ce+3]": 436,
  "O=C(Nc1ccccc1)c1ccc[cH]1[Fe][cH]1cccc1": 437,
  "O=C(O)C1=C2Oc3ccc(Br)cc3OC(c3ccc4c(c3)Oc3c(Br)cccc3O4)=C2C=CC1=O": 438,
  "O=C(O)C1CCCN1": 439,
  "O=C(O)C1CCNC1": 440,
  "O=C(O)c1cc2c(=O)c3cccc(Br)c3oc2cc1Br": 441,
  "O=C(O)c1ccccc1-c1c2c(oc3c(Br)c(=O)c(Br)c(Br)c1-3)C(=O)C(Br)=C(Br)C2=O": 442,
  "O=C(O)c1ccccc1-c1c2cc(Br)c(=O)c(Br)c-2oc2c(Br)c(O)c(Br)cc12": 443,
  "O=C(O)c1ccccc1-c1c2cc(C(=O)O)c(=O)cc-2oc2cc(O)ccc12": 444,
  "O=C(O)c1ccccc1-c1c2ccc(=O)cc-2oc2cc(O)ccc12": 445,
  "O=C(O)c1ccccc1C1c2cccc(Br)c2Oc2c1cc(C(=O)O)c(Br)c2Br": 446,
  "O=C([O-])c1cc2c(=O)c3cccc(Br)c3oc2cc1Br.O=C([O-])c1cc2c(=O)c3cccc(Br)c3oc2cc1Br.[Na+].[Na+]": 447,
  "O=C([O][Na])c1cc(Br)ccc1-c1cc(O)cc(Br)c1-c1cc(Br)cc(O)c1-c1ccc(O)cc1Br": 448,
  "O=C([O][Na])c1ccc(-c2cc(Br)cc(O)c2-c2cc(Br)cc(O)c2-c2ccc(O)cc2Br)c(-c2c(O)cc(Br)cc2O)c1.[Na+]": 449,
  "O=C([O][Pd][O]C(=O)C(F)(F)F)C(F)(F)F": 450,
  "O=C1C(=C2C=c3c(cccc3Oc3ccccc3)C2=O)C(=O)c2c(Br)cc(Br)c(Br)c21": 451,
  "O=C1C(=O)c2ccccc2C1=C1C(=O)c2ccccc2C1=O": 452,
  "O=C1C=C(O)C(=C(Br)c2ccc3c(c2)C(=O)OC3(C(=O)[O-])C(=O)[O-])C=C1Br.[Na+].[Na+]": 453,
  "O=C1C=CC(=O)c2ccccc21": 454,
  "O=C1C=CC2=C(c3ccc4c(c3)Oc3c(Br)cccc3O4)C3C=CC(=O)C=C3OC2=C1": 455,
  "O=C1C=Cc2ccccc2C1=O": 456,
  "O=C1c2ccccc2-c2ccccc21": 457,
  "O=P1(O)Oc2c(-c3ccc4ccccc4c3)cc3c(c2C2=C(c4ccc5ccccc5c4)C=C4CCCCC42O1)CCCC3": 458,
  "O=P1(O)Oc2c([Si](c3ccccc3)(c3ccccc3)c3ccccc3)cc3ccccc3c2-c2c([Si](c3ccccc3)(c3ccccc3)c3ccccc3)cc3ccccc3c2O1": 459,
  "O=S(=O)(Nc1ccc[c]-1[Fe][c]1cccc1)C1=CC=CC=C1": 460,
  "O=S(=O)(O)O": 461,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Ce+3]": 462,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Sc+3]": 463,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Ni+2]": 464,
  "O=S(=O)([O-])C(F)(F)F.O=S(=O)([O-])C(F)(F)F.[Zn+2]": 465,
  "O=S(=O)([O-])C(F)(F)F.[Ag+]": 466,
  "O=S(=O)([O-])[O-].[Cu+2]": 467,
  "O=S(=O)([O-])[O-].[Mn+2]": 468,
  "O=S(=O)([O][Ni][O]S(=O)(=O)C(F)(F)F)C(F)(F)F": 469,
  "[Br-].[Br-].[Br-].[Fe+3]": 470,
  "[Br-].[Br-].[Ni+2].c1ccncc1.c1ccncc1.c1ccncc1.c1ccncc1": 471,
  "[Br-].[Cu+]": 472,
  "[Br-].[K+]": 473,
  "[Br-][Ni+2]1([Br-])[N]2=CC=C(C=C2C=3C=C(C=C[N]31)C(C)(C)C)C(C)(C)C": 474,
  "[Br-][Ni+2]12([Br-])[N]=3C=CC=CC3C4=CC=CC(C=5C=CC=C[N]51)=[N]42": 475,
  "[Br][Ni][Br].c1cnc2c(c1)ccc1cccnc12": 476,
  "[C].[Zn]": 477,
  "[Cl-].[Cl-].[Fe+2].[Ni+2].c1ccc(P(c2ccccc2)[c-]2cccc2)cc1.c1ccc(P(c2ccccc2)[c-]2cccc2)cc1": 478,
  "[Cl-].[Cl-].[Fe+2].[Ni+2].c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1": 479,
  "[Cl-].[Cl-].[Mg+2]": 480,
  "[Cl-].[Cl-].[Ni+2].c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1": 481,
  "[Cl-].[Cl-].[Ni+2].c1ccncc1.c1ccncc1.c1ccncc1.c1ccncc1": 482,
  "[Cl-].[Na+]": 483,
  "[Cl-][Mn+3]123[N]([C@@]4([C@@]([N]1=CC=5C([O-]2)=C(C(C)(C)C)C=C(C(C)(C)C)C5)(CCCC4)[H])[H])=CC=6C([O-]3)=C(C(C)(C)C)C=C(C(C)(C)C)C6": 484,
  "[Cl-][Os+2]123456([Cl-][Os+2]789%10%11([Cl-])([Cl-]1)[CH]=%12[CH]%11=C%10(C(C)C)[CH]9=[CH]8C%127C)[CH]=%13[CH]6=C5(C(C)C)[CH]4=[CH]3C%132C": 485,
  "[Cl][Ni]([Cl])([PH](c1ccccc1)(c1ccccc1)c1ccccc1)[PH](c1ccccc1)(c1ccccc1)c1ccccc1": 486,
  "[Cl][Ni][Cl].c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1": 487,
  "[Cl][Ni][Cl].c1cnc2c(c1)ccc1cccnc12": 488,
  "[Cl][Pd][Cl].c1ccccc1.c1ccccc1": 489,
  "[F-][B+3]([F-])([F-])O(CC)CC": 490,
  "[F-][B+3]([F-])([F-])[F-].CCCC[N+](CCCC)(CCCC)CCCC": 491,
  "[F-][P+5]([F-])([F-])([F-])([F-])[F-].C(#[N][Rh+3]12([N]#CC)([C-]=3C=CC=CC3C=4SC5=CC=C(C=C5[N]41)C(C)(C)C)[C-]=6C=CC=CC6C=7SC8=CC=C(C=C8[N]72)C(C)(C)C)C": 492,
  "[Fe+2].[c-]1cccc1": 493,
  "[Fe+2].c1cccc1.c1cccc1": 494,
  "[Fe+2][N-]C1=Nc2nc(nc3[n-]c(nc4nc(nc5[n-]c(n2)c2ccccc52)-c2ccccc2-4)c2ccccc32)-c2ccccc21": 495,
  "[I][Ni][I]": 496,
  "[Ir+3].[c-]1ccccn1-c2ccccc2.[c-]1ccccn1-c2ccccc2.[c-]1ccccn1-c2ccccc2": 497,
  "[Ir+3].c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1": 498,
  "[Ni+2].[O-][Cl+3]([O-])([O-])[O-].[O-][Cl+3]([O-])([O-])[O-]": 499,
  "[O-]1c2cc(cc2C=[N+]3C(C)(C)C([N+]4=cc5cc(ccc5[O-][Co+2]134)C(C)(C)C)(C)C)C(C)(C)C": 500,
  "[O-]Cl(=O)(=O)=O.C[n+]1c2ccccc2cc2ccccc21-c1c(C)cc(C)cc1C": 501,
  "[O]=[Pd]": 502,
  "[Pd].c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1.c1ccc(P(c2ccccc2)c2ccccc2)cc1": 503,
  "[Ru+2].c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1.c1ccc(-c2ccccn2)nc1": 504,
  "[Zn]": 505,
  "c1c[CH]2[CH]c1[Fe+2]13[CH]c[CH]c[CH]c1[CH]c[CH]c[CH]c3": 506,
  "c1cc2c(c(c1)Br)Oc1cc(Br)c(=O)c(Br)c-1o2": 507,
  "c1cc2c(c(c1)Br)Oc1cc(ccc1O2)C1=Cc2cc(Br)c(=O)c(c2C=C1C(=O)O)O": 508,
  "c1cc2c(c[c]1[Fe][c]1ccc3c(c1)CCCC3)CCCC2": 509,
  "c1cc2c(cc1O)c(c1ccccc1)cc([O-])c2=O": 510,
  "c1cc2c(cc1O)c1c3c(c(=O)c(c-2cc1=O)Br)C(=C(C(=O)O3)O)Br": 511,
  "c1cc2c(cc1O)c1c3c(c(=O)c(c-2cc1=O)C(=O)O)C(Br)(Br)C(Br)(Br)C3(Br)Br": 512,
  "c1cc2c(cc1O)c1c3c(c(=O)c(c-2cc1=O)C(=O)O)C=C(Br)C(=O)C=3Br": 513,
  "c1cc2c(cc1O)c1c3c(c(=O)c1c(=O)c2c1ccccc1C(=O)[O-])C(=O)C(=O)C3=O.[Na+]": 514,
  "c1cc2c(cc1O)c1c3c(c(=O)c1c1c2c(c2ccccc21)C(=O)[O-])C(=O)[O-].[Na+].[Na+]": 515,
  "c1cc2c(cc1O)c1c3c(c(=O)c1c1c2c(cc1)C(=O)O)C(=O)C(=C3)Br": 516,
  "c1cc[c]([Fe]2[c]3cccc[c]32)cc1": 517,
  "c1ccc(-c2cccc[c]2[Ir+3]([c]2ccccc2-c2ccccn2)[c]2ccccc2-c2ccccn2)nc1": 518,
  "c1ccc(-c2nc3c4ccccc4c4ccccc4c3[nH]2)cc1": 519,
  "c1ccc(C(c2ccccc2)C2CCCN2)cc1": 520,
  "c1ccc(N2c3ccccc3Sc3ccccc32)cc1": 521,
  "c1ccc(cc1)c2c3cc(c(c(c3oc4c2c(cc(c4Br)Br)Br)Br)C(=O)[O-])=O": 522,
  "c1ccc(cc1)c2c3nc(cc4nc(cc5nc(cc(n2)c1ccccc1)c(c5)c1ccccc1)c(c4)c1ccccc1)c(c3)c1ccccc1.[Mn]Cl": 523,
  "c1ccc2ccccc2c1": 524,
  "c1ccc[cH]1[Fe+][cH]1cccc1.F[P-](F)(F)(F)(F)F": 525
 },
 "reagent": {
  "__ABSENT__": 0,
  "__OTHER__": 1,
  "O=C(O)C(F)(F)F": 2,
  "CC(=O)O": 3,
  "O": 4,
  "O=C([O-])[O-].[K+].[K+]": 5,
  "Cl": 6,
  "O=C([O-])[O-].[Na+].[Na+]": 7,
  "CCN(CC)CC.F.F.F": 8,
  "CC(=O)[O-].[Na+]": 9,
  "CCN(CC)CC": 10,
  "C[Si](C)(C)N=[N+]=[N-]": 11,
  "C1CCC2=NCCCN2CC1": 12,
  "Cc1cccc(C)n1": 13,
  "CC(C)(C)C(=O)[O-].[Na+]": 14,
  "O=S(=O)(O)C(F)(F)F": 15,
  "O=P([O-])([O-])O.[K+].[K+]": 16,
  "O=S(=O)([O-])C(F)(F)F.[Na+]": 17,
  "Cc1ccc(I)cc1": 18,
  "O=P([O-])([O-])[O-].[K+].[K+].[K+]": 19,
  "Cc1ccc(S(=O)(=O)O)cc1": 20,
  "O=O": 21,
  "O=S([O-])C(F)(F)F.[Na+]": 22,
  "OC(C(F)(F)F)C(F)(F)F": 23,
  "O=C([O-])O.[Na+]": 24,
  "O=C1CCC(=O)N1Cl": 25,
  "[Cl-].[Na+]": 26,
  "[Br-].[Na+]": 27,
  "O=C=O": 28,
  "[Fe+2].c1cc[cH-]c1.c1cc[cH-]c1": 29,
  "O=C[O-].[Na+]": 30,
  "CC(C)(C)[O-].[K+]": 31,
  "c1ccc([Se][Se]c2ccccc2)cc1": 32,
  "Br": 33,
  "ClC(Cl)(Cl)C(Cl)(Cl)Cl": 34,
  "O=C1CCC(=O)N1Br": 35,
  "O.O.O.O.O.O.O.O.O.O=[N+]([O-])[O-].O=[N+]([O-])[O-].O=[N+]([O-])[O-].[Fe+3]": 36,
  "CC(C)(C)OOC(=O)c1ccccc1": 37,
  "N=C(c1ccccc1)c1ccccc1": 38,
  "C[Si](C)(C)Cl": 39,
  "[Cl-].[Cl-].[Mg+2]": 40,
  "[Cl-].[Li+]": 41,
  "ClCCCl": 42,
  "CO": 43,
  "c1ccncc1": 44,
  "CC(C)C(=O)O": 45,
  "[Cs+].[F-]": 46,
  "COC(=O)c1ccc2cc(C(=O)OC)ccc2c1": 47,
  "O=C([O-])C(F)(F)F.[Na+]": 48,
  "BrCCBr": 49,
  "CC(=O)OC(C)=O": 50,
  "CCc1ccc(B(O)O)cc1": 51,
  "O=CO": 52,
  "CN(C)CCN(C)C": 53,
  "[I-].[Na+]": 54,
  "F": 55,
  "O=C([O-])[O-].[Cs+].[Cs+]": 56,
  "c1ccc([SiH2]c2ccccc2)cc1": 57,
  "FC(F)(F)c1ccncc1": 58,
  "CC(C)(C)c1cccc(C(C)(C)C)n1": 59,
  "O.O.O.O.[Cl-].[Cl-].[Mn+2]": 60,
  "CS(=O)(=O)O": 61,
  "O=S([O-])O.[Na+]": 62,
  "CC(C)(C)ON=O": 63,
  "CC[SiH](CC)CC": 64,
  "OB(O)c1ccccc1": 65,
  "COC(=O)c1ccc(C(=O)OC)cc1": 66,
  "N": 67,
  "O=S(=O)(O)O": 68,
  "[Na+].[OH-]": 69,
  "CC(C)(C)C(=O)O": 70,
  "CC(C)(C)C(=O)[O-].O.[Na+]": 71,
  "O=C(O)O.[Na]": 72,
  "[N-]=[N+]=[N-].[Na+]": 73,
  "C1CN2CCN1CC2": 74,
  "CC[NH+](CC)CC.[Cl-]": 75,
  "O.O.O.O.[Cl][Mn][Cl]": 76,
  "OCCN(CCO)CCO": 77,
  "[Ce+3].[Cl-].[Cl-].[Cl-]": 78,
  "O.O.O.O.O.O.[Cl-].[Cl-].[Cl-].[Fe+3]": 79,
  "CCCC[N+](CCCC)(CCCC)CCCC.Cc1ccc(S(=O)(=O)[O-])cc1": 80,
  "Cc1ccc(S(=O)[O-])cc1.[Na+]": 81,
  "Fc1c(F)c(F)c(B(c2c(F)c(F)c(F)c(F)c2F)c2c(F)c(F)c(F)c(F)c2F)c(F)c1F": 82,
  "NCCCN": 83,
  "O=C([O-])O.[K+]": 84,
  "CC(C)(C)O.[K]": 85,
  "CCCC[N+](CCCC)(CCCC)CCCC.F[B-](F)(F)F": 86,
  "c1ccc(P(c2ccccc2)c2ccccc2)cc1": 87,
  "CCN(CC)CC.[F-]": 88,
  "CC[Si](CC)CC": 89,
  "[I-].[NH4+]": 90,
  "Brc1ccc(N(c2ccc(Br)cc2)c2ccc(Br)cc2)cc1": 91,
  "[KH].[O]=[K]": 92,
  "CC(=O)[O-].O.O.O.[Na+]": 93,
  "CC1(C)CCCC(C)(C)N1[O]": 94,
  "COc1ccc(I)cc1": 95,
  "C[N+](C)(C)Cc1ccccc1.[Cl-]": 96,
  "O=S([O-])([O-])=S.[Na+].[Na+]": 97,
  "O=[N+]([O-])[O-].[Ag+]": 98,
  "Cl[Si](c1ccccc1)(c1ccccc1)c1ccccc1": 99,
  "O=P([O-])(O)O.[K+]": 100,
  "O=S([O][Na])C(F)(F)F": 101,
  "CCN(C(C)C)C(C)C": 102,
  "O=C(O)O.[K]": 103,
  "CC(=O)[O-].[K+]": 104,
  "N#C[S-].[K+]": 105,
  "N#CC(Cl)(Cl)Cl": 106,
  "[Br-].c1cc[nH+]cc1": 107,
  "CCN(CC)CC.F.F.F.F.F": 108,
  "N#CC1=C(C#N)C(=O)C(Cl)=C(Cl)C1=O": 109,
  "CC1(C)CCCC(C)(C)N1O": 110,
  "CCOC(C)=O": 111,
  "O.O.O.O.O.O.O.O.O.O=[N+]([O-])O.O=[N+]([O-])O.O=[N+]([O-])O.[Fe+3]": 112,
  "O=P([O-])([O-])O.[NH4+].[NH4+]": 113,
  "COc1cc(C)cc(OC)c1I": 114,
  "O=C1c2ccccc2C(=O)N1O": 115,
  "O=P([O-])([O-])[O-].[K+].[K+]": 116,
  "CC(C)(C)OC(=O)NNS(=O)(=O)C(F)(F)F": 117,
  "C[Si](C)(C)C#N": 118,
  "Ic1ccccc1": 119,
  "O=[N+]([O-])c1ccccc1O": 120,
  "[Pt]": 121,
  "c1ccccc1": 122,
  "CC(=O)O.[Na]": 123,
  "CCN(CC)CC.F": 124,
  "[K+].[OH-]": 125,
  "ClCC(Cl)(Cl)Cl": 126,
  "O=S([O-])S(=O)(=O)[O-].[K+].[K+]": 127,
  "O=[N+]([O-])[O-].[Na+]": 128,
  "[Cl-].[NH4+]": 129,
  "BrCBr": 130,
  "C[Si](C)(C)[Si](O)([Si](C)(C)C)[Si](C)(C)C": 131,
  "O=C1[N-]C(=O)c2ccccc21.[K+]": 132,
  "N#C[S-].[NH4+]": 133,
  "OCC(F)(F)F": 134,
  "CCOCC.FB(F)F": 135,
  "CS(C)=O": 136,
  "O=P([O-])([O-])O.[Na+].[Na+]": 137,
  "O=S([O-])C(F)F.[Na+]": 138,
  "[Na][Br]": 139,
  "CN(C)C=O": 140,
  "F[P-](F)(F)(F)(F)F.[NH4+]": 141,
  "O=P(O)(O)O.[K]": 142,
  "[N-]=C=S.[NH4+]": 143,
  "CC(C)(C)C(=O)[O-].[K+]": 144,
  "Cc1cc(C)nc(C)c1": 145,
  "O=C([O-])C(F)(F)F.O=C([O-])C(F)(F)F.O=C([O-])C(F)(F)F.[Y+3]": 146,
  "O=S(=O)(c1ccccc1)C(F)(F)F": 147,
  "O=S([O-])S(=O)[O-].[K+].[K+]": 148,
  "O=S([O-])S(=O)[O-].[Na+].[Na+]": 149,
  "CC(C)(C)c1ccc(I)cc1": 150,
  "CN(C)c1ccncc1": 151,
  "F.c1ccncc1": 152,
  "O=C(O)C=Cc1ccccc1": 153,
  "[Cl-].[Cl-].[Fe+2]": 154,
  "[SiH3]c1ccccc1": 155,
  "C[O-].[Na+]": 156,
  "ClC(Cl)Br": 157,
  "F.N": 158,
  "S=C=S": 159,
  "[Cl-].[Cl-].[Cl-].[Fe+3]": 160,
  "[Cl-].[Cl-].[Co+2]": 161,
  "BrC(Br)(Br)Br": 162,
  "CC(=O)OI(OC(C)=O)c1ccccc1": 163,
